{"job_id":"4229143806","company":"Allegiant","title":"Business Intelligence Analyst","location":"Las Vegas, NV","date_posted":"15 hours ago","applicants":"Over 200 applicants","seniority_level":"Associate","employment_type":"Full-time","job_function":"Research, Analyst, and Information Technology","industries":"Hospitality, Food and Beverage Services, and Retail","company_website":null,"workplace_type":null,"description":"Summary\nThe Business Intelligence Analyst I translates data into persuasive insight that answers key business questions and understands and assists in the development of reporting, analysis and visualization of business data, metrics and measures in order to allow staff to align and track against overall business strategies, goals and objectives. The Business Intelligence Analyst drives innovation, insight and decision making.\nVisa Sponsorship Available\nNo\nMinimum Requirements\nCombination of Education and Experience will be considered. Must be authorized to work in the US as defined by the Immigration Act of 1986. Must pass a Criminal Background Check.\nEducation: Bachelor’s Degree In Finance, Accounting, Computer Science, Mathematics, Engineering or related field.\nTableau and SQL experience\nResults-driven; accepting responsibility for individual performance and contributions to team projects\nAbility to work with cross-functional groups in a collaborative environment\nManages time effectively in order to meet timelines across multiple projects\nStrong systems skills, with advanced proficiency in Microsoft Office (Word, Excel, PowerPoint, and Access)\nAbility to learn quickly and translate data into clear and actionable results, and strong organizational skills\nExcellent critical thinker and effective problem solver with creative solutions\nDetail oriented and highly organized\nStrong oral and written communication skills, ability to present to senior management\nDeals well with and finds ways to decrease ambiguity\nPreferred Requirements\nPython, R, or other programming language experience\nJob Duties\nDesign, develop, implement and maintain new reporting functionality and analytic applications across multiple business units using various business intelligence tools\nCollaborate with business users and subject-matter experts to establish technical vision and analysis with regards to business usability and performance requirements\nEnhance and maintain existing reports and analytical applications\nBuild predictive models and forecasts\nInteract with the DBA and Development teams for building of solutions, system maintenance, and report\/application development\nAdministrate reporting services applications and ensures accurate and timely automated reporting\nAssist with implementation of data quality improvement processes and initiatives\nUnderstand the development of ETL (Extraction, Transformation and Loading) processes to acquire data from internal and external sources\nDevelop and maintain repeatable, systemic processes while finding ways to make internal team processes more efficient\nWork with 3rd Party APIs to extract and store data needed for reports\nModel Allegiant’s customer service standards in personal actions and when providing leadership direction\nOther duties as assigned\nPhysical Requirements\nThe Physical Demands and Work Environment described here are a representative of those that must be met by a Team Member to successfully perform the essential functions of the role. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the role.\nOffice - While performing the duties of this job, the Team Member is regularly required to stand, sit, talk, hear, see, reach, stoop, kneel, and use hands and fingers to operate a computer, key board, printer, and phone. May be required to lift, push, pull, or carry up to 20 lbs. May be required to work various shifts\/days in a 24-hour situation. Regular attendance is a requirement of the role. Exposure to moderate noise (i.e. business office with computers, phones, printers, and foot traffic), temperature and light fluctuations. Ability to work in a confined area as well as the ability to sit at a computer terminal for an extended period of time. Some travel may be a requirement of the role.\nEssential Services Provider\nAllegiant as a national air carrier is deemed an essential service provider during declared national and state emergencies. Team Members will be required to report to their assigned trip or work location during national and state emergencies unless prohibited by local, state or federal order.\nEEO Statement\nWe welcome all individuals from varied backgrounds and experiences to apply. Our company celebrates diversity, and we value the unique perspectives and talents that each person brings to our team.\nEqual Opportunity Employer: Disability\/Veteran\nFor more information, see https:\/\/allegiantair.jobs\nFull Time Benefits:\nProfit Sharing\nMedical\/Dental\/Vision\/Life\/ Disability Insurance\nMedical Travel Reimbursement\nLegal, Identity and Pet Insurance\n401K with an employer match\nEmployee Stock Purchase Plan\nEmployee Assistance Program\nTuition Reimbursement\nFlight Benefits\nPaid vacation, holidays, and sick time\nPart Time Benefits:\nProfit Sharing\nMedical Travel Reimbursement\nLegal, Identity and Pet Insurance\n401K with an employer match\nEmployee Stock Purchase Plan\nEmployee Assistance Program\nTuition Reimbursement\nFlight Benefits\nSick time\nShow more\nShow less","all_details":"- Tableau and SQL experience\n- Results-driven; accepting responsibility for individual performance and contributions to team projects\n- Ability to work with cross-functional groups in a collaborative environment\n- Manages time effectively in order to meet timelines across multiple projects\n- Strong systems skills, with advanced proficiency in Microsoft Office (Word, Excel, PowerPoint, and Access)\n- Ability to learn quickly and translate data into clear and actionable results, and strong organizational skills\n- Excellent critical thinker and effective problem solver with creative solutions\n- Detail oriented and highly organized\n- Strong oral and written communication skills, ability to present to senior management\n- Deals well with and finds ways to decrease ambiguity\n- Python, R, or other programming language experience\n- Design, develop, implement and maintain new reporting functionality and analytic applications across multiple business units using various business intelligence tools\n- Collaborate with business users and subject-matter experts to establish technical vision and analysis with regards to business usability and performance requirements\n- Enhance and maintain existing reports and analytical applications\n- Build predictive models and forecasts\n- Interact with the DBA and Development teams for building of solutions, system maintenance, and report\/application development\n- Administrate reporting services applications and ensures accurate and timely automated reporting\n- Assist with implementation of data quality improvement processes and initiatives\n- Understand the development of ETL (Extraction, Transformation and Loading) processes to acquire data from internal and external sources\n- Develop and maintain repeatable, systemic processes while finding ways to make internal team processes more efficient\n- Work with 3rd Party APIs to extract and store data needed for reports\n- Model Allegiant’s customer service standards in personal actions and when providing leadership direction\n- Other duties as assigned"}
{"job_id":"4217752610","company":"DataAnnotation","title":"Software Developer","location":"Nevada, United States","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Contract","job_function":"Engineering, Research, and Analyst","industries":"Software Development, Computer and Network Security, and Engineering Services","company_website":null,"workplace_type":null,"description":"DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.\nWe are looking for a proficient Software Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.\nTo apply to this role, you will need to be proficient in either Python and\/or JavaScript. Your role will require proficiency in at least one programming language\/framework (JavaScript, TypeScript, Python, C, C#, C++, HTML\/CSS, React, Go, Java, Kotlin, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.\nBenefits:\nThis is a full-time or part-time REMOTE position\nYou’ll be able to choose which projects you want to work on\nYou can work on your own schedule\nProjects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume work\nResponsibilities:\nCome up with diverse problems and solutions for a coding chatbot\nWrite high-quality answers and code snippets\nEvaluate code quality produced by AI models for correctness and performance\nQualifications:\nFluency in English (native or bilingual level)\nProficient in either Python and\/or JavaScript\nExcellent writing and grammar skills\nA bachelor's degree (completed or in progress)\nPrevious experience as a Software Developer, Coder, Software Engineer, or Programmer\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.\nShow more\nShow less","all_details":"DataAnnotation is committed to creating quality AI. Join our team to help train AI chatbots while gaining the flexibility of remote work and choosing your own schedule.\nWe are looking for a proficient Software Developer to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.\nTo apply to this role, you will need to be proficient in either Python and\/or JavaScript. Your role will require proficiency in at least one programming language\/framework (JavaScript, TypeScript, Python, C, C#, C++, HTML\/CSS, React, Go, Java, Kotlin, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.\nBenefits:\n- This is a full-time or part-time REMOTE position\n- You’ll be able to choose which projects you want to work on\n- You can work on your own schedule\n- Projects are paid hourly, starting at $40+ USD per hour, with bonuses for high-quality and high-volume work\nResponsibilities:\n- Come up with diverse problems and solutions for a coding chatbot\n- Write high-quality answers and code snippets\n- Evaluate code quality produced by AI models for correctness and performance\nQualifications:\n- Fluency in English (native or bilingual level)\n- Proficient in either Python and\/or JavaScript\n- Excellent writing and grammar skills\n- A bachelor's degree (completed or in progress)\n- Previous experience as a Software Developer, Coder, Software Engineer, or Programmer\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, UK, Canada, Australia, or New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time."}
{"job_id":"4167266513","company":"CU*Answers","title":"Programmer - Analyst","location":"Las Vegas, NV","date_posted":"2 months ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services","company_website":null,"workplace_type":null,"description":"Description\nPOSITION SUMMARY\nThe Programmer\/Analyst is responsible for analyzing and programming applications on the IBMi system in readable and maintainable code, testing and debugging systems, and providing daily support for the Client Service and Operations departments.\nEssential Job Functions\nPerform analysis, coding and testing using all forms of RPGLE including free form and embedded SQL, CLLE, DDL, and DDS.\nKnowledgeable in procedures, sub-procedures, stored procedures and modular programming\nFollow standards as outlined in the Programming Standards and Guidelines documentation.\nResearch problems and questions from Client Service Representatives and Operations personnel.\nPerform data conversions for credit unions coming from other processors.\nInterface with third-party vendors (ATM processors, insurance companies, credit bureaus, etc.).\nKeep up to date on the latest OS version, programming language levels and other industry releases.\nMaintain a positive contribution as a member of the Programming Team and complete all tasks assigned by management to meet team objectives.\nJob Qualifications\nFour-year degree in business-related, IT or project management field or equivalent work experience is required. Equivalent experience would be at least 2-3 years of working experience in programming.\nFamiliarity with credit union operations, regulations and procedures, accounting and balancing functions preferred but not required.\nExcellent verbal and written communication skills; ability to deal with external clients as well as internal staff.\nExcellent attention to detail and accuracy.\nWell-versed in RPGLE, CLLE, DDL, SQL, and modular coding.\nKnowledge of other computer systems and data storage types.\nBasic understanding of communications for use in data transmissions.\nAbility to use discretion when dealing with sensitive or confidential data.\nCU*Answers is an Equal Employment Opportunity employer that supports the unique perspectives and experiences from all employees and supports a collaborative community spirit. All qualified applicants will receive consideration for employment without regard to age, citizenship status, color, creed, disability, ethnicity, genetic information, gender (including gender identity and gender expression), marital status, national origin, race, religion, sex, sexual orientation, veteran status or any status or condition protected by applicable federal, state or local laws.\nShow more\nShow less","all_details":"- Perform analysis, coding and testing using all forms of RPGLE including free form and embedded SQL, CLLE, DDL, and DDS.\n- Knowledgeable in procedures, sub-procedures, stored procedures and modular programming\n- Follow standards as outlined in the Programming Standards and Guidelines documentation.\n- Research problems and questions from Client Service Representatives and Operations personnel.\n- Perform data conversions for credit unions coming from other processors.\n- Interface with third-party vendors (ATM processors, insurance companies, credit bureaus, etc.).\n- Keep up to date on the latest OS version, programming language levels and other industry releases.\n- Maintain a positive contribution as a member of the Programming Team and complete all tasks assigned by management to meet team objectives.\n- Four-year degree in business-related, IT or project management field or equivalent work experience is required. Equivalent experience would be at least 2-3 years of working experience in programming.\n- Familiarity with credit union operations, regulations and procedures, accounting and balancing functions preferred but not required.\n- Excellent verbal and written communication skills; ability to deal with external clients as well as internal staff.\n- Excellent attention to detail and accuracy.\n- Well-versed in RPGLE, CLLE, DDL, SQL, and modular coding.\n- Knowledge of other computer systems and data storage types.\n- Basic understanding of communications for use in data transmissions.\n- Ability to use discretion when dealing with sensitive or confidential data."}
{"job_id":"4197146939","company":"Panasonic Energy Corporation of North America","title":"Vision Engineer I","location":"Sparks, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering","industries":"Services for Renewable Energy","company_website":null,"workplace_type":null,"description":"Overview\nDo you want to join a team that's changing the world? Do you have a strong background as a Vision Engineer I? Then we're looking for you! Check out the job description and apply now! Put your skills to meaningful use, gain unique experience, and work with world-class team members with diverse backgrounds and expertise who share the same vision. Join the PENA team today!\nResponsibilities\nMeet Panasonic\nMeet the Recruiter: Joe Richie\nExplore Panasonic Careers\nPanasonic Video Our Mission: Create Technologies That Move Us\nJob Title:\nVision Engineer I\nDepartment:\nManufacturing Engineering\nJob Summary:\nPanasonic Energy Corporation of North America is collaborating with Tesla Motors, Inc. in a large-scale advanced battery manufacturing facility known as the Gigafactory near Reno, Nevada which is known for its quality of life and expansive outdoor adventures. Panasonic manufactures and supplies cylindrical lithium-ion cells for the world’s leading electric vehicle manufacturer, Tesla Motors, Inc. Based on the battery demand from Tesla, the Gigafactory plans to produce cells which will double the world’s current production.\nOur mission at PECNA is to make the vision of affordable Electric Vehicles a reality by production of the world’s safest, highest-quality, and lowest-cost batteries. Through this effort we will create a clean energy society and our products will change society’s use of and perceptions of electric power.\nEssential Duties:\nProgramming, installing, and troubleshooting Keyence vision systems within Panasonic’s battery manufacturing processes.\nProviding machine-vision-related technical support to ongoing production operations.\nDeveloping moving camera calibration algorithms.\nAnalyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods.\nDetermining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors.\nProviding technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning.\nPreparing or directing preparation of product or system layout and detailed drawings and schematics.\nOther duties may be assigned.\nPersonal Protective Equipment (PPE) Requirements:\nTo ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PENA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\nThe foregoing description is not intended and should not be construed to be an exhaustive list of all responsibilities, skills and efforts or work conditions associated with the job. It is intended to be an accurate reflection of the general nature and level of the job.\nQualifications\nEducation:\nBasic\/Required: Bachelor’s degree in Electrical Engineering, Mechanical Engineering, or related field\nPreferred: None\nEssential Qualifications:\nProficiency with XG-X, LI-V Keyence controllers.\nExperience working with vision system databases.\nKnowledge of camera, light, and lens selection for applications ranging from defect detection to part location.\nExperience with quality and reliability improvement using data acquisition in conjunction with Six Sigma, Cpk, Gauge R&R, and similar quality tools.\nSkilled in the utilization of statistical analysis.\nProgramming background with high-level languages such as C, C++, and Python.\nBackground working in a high-volume manufacturing environment.\nMust have working-level knowledge of the English language, including reading, writing, and speaking English\nPreferred Qualifications:\nExperience programming, installing, and troubleshooting PLC systems such as Mitsubishi and Omron.\nExperience programming, installing, and troubleshooting Cognex manufacturing image vision systems.\nFamiliarity with wiring\/cabling size\/terminations and load\/temperature requirements.\nFamiliarity with industrial machinery design & related NFPA codes:\n70\n79 (and related UL standards for industrial machinery)\nAlignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)\nPreferred License(s):\nNone\nPreferred Certification(s):\nNone\nPhysical Demands:\nPhysical Activities: (Percentage of time (equaling 100%) during the normal workday the employee is required to)\nSit: 40%\nWalk: 30%\nStand: 20%\nLift: 10%\nRequired Lifting and Carrying: (Required frequency is: Not required (0%), Occasional (1-33%), Frequent (34-66%, Continuous (67-100%)\nUp to 10 lbs.: Occasional\nUp to 20 lbs.: Occasional\nUp to 35 lbs.: Occasional\nTeam-lift only (over 35 lbs.): Not Required\nPhysical Demands\n:\nPhysical Activities:\n(Percentage of time (equaling 100%) during the normal workday the employee is required to)\nSit: 40%\nWalk: 30%\nStand: 20%\nLift: 10%\nRequired Lifting and Carrying:\n(Required frequency is: Not required (0%), Occasional (1-33%), Frequent (34-66%, Continuous (67-100%)\nUp to 10 lbs.: Occasional\nUp to 20 lbs.: Occasional\nUp to 35 lbs.: Occasional\nTeam-lift only (over 35 lbs.): Not Required\nBenefits & Perks - What's In It For You:\nPanasonic Energy prioritizes total well-being and offers comprehensive benefits options to support physical, emotional, financial, social, and environmental health:\nHighly inclusive and class-leading healthcare options to include family planning, mental health, and pet insurance\nEmployee assistance programs that support total well-being with complimentary session offered each and every month\nCompany-matched and fully vested 401K retirement program that starts immediately from date of enrollment\nAnnual bonus program, High5 employee recognition and awards platform, quarterly and annual employee recognition\nSimplified access to self-guided and representative-supported short and long-term financial wellness and retirement planning\nEducational Assistance & Reimbursement Program\nDiversity, equity, and inclusion programs and associated employee resource groups that promote representation and belonging\nLeadership, career, and mentorship development programs opportunities at all levels across the organization\nSeveral on-site cafes, plentiful snack and beverage kitchens, revolving on-site vendor visits and employee events\nCollaborative and motivating culture routed in continuous personal and professional growth and much more.\nShuttle rides to and from work!\nWhere You'll Be:\nFor our onsite roles, Panasonic Energy is committed to fostering an ideal working environment that goes beyond the conventional. We understand the significance of moments that matter in your onsite experience, and we prioritize creating a workspace that not only promotes productivity but also ensures a fulfilling and positive work atmosphere. Join us at Panasonic Energy, where your onsite presence is valued, and we strive to make each moment count in your professional journey.\nWho We Are:\nMeet Panasonic Energy! At Panasonic Energy, you'll do work that matters as we are dedicated to transforming the world through the acceleration of sustainable energy. By producing safe, high-quality lithium-ion batteries, you become part of a team that plays a crucial role in creating technologies that move us.\nOur journey began in 2017, and now, as the world's largest lithium-ion battery factory, we are expanding operations to De Soto, Kansas, providing you with the opportunity to experience career growth in more ways than one.\nAs an innovative thinker, you'll thrive here, as we continually push the boundaries of lithium-ion battery technology and production capabilities to enhance efficiency and performance in EVs.\nBeing part of Panasonic Energy means positively contributing to society, aligning with our commitment to building a better world through sustainable energy solutions.\nWe care about what you care about, fostering an environment where your contributions make a meaningful impact on the future of energy and transportation. Join us and be part of a team that values your work, encourages innovation, and actively contributes to a positive societal impact.\nIn addition to an environment that is as innovative as our products, we offer competitive salaries and benefits.\nWe Take Opportunity Seriously:\nAt Panasonic Energy, we are committed to a workplace that genuinely fosters inclusion and belonging. Fairness and Honesty have been part of our core values for more than 100 years and we are proud of our diverse culture as an equal opportunity employer.\nWe understand that your career search may look different than others and embrace the professional, personal, educational, and volunteer opportunities through which people gain experience. If you are actively looking or starting to explore new opportunities, submit your application!\nSupplemental Information:\nPre-employment drug testing is required. Qualified applicants will receive consideration for employment without regard to characteristics protected by law.\nDue to the high volume of responses, we will only be able to respond to candidates of interest. All candidates must have valid authorization to work in the U.S. without restriction.\nThank you for your interest in Panasonic Energy Corporation of North America.\nR-100551\nShow more\nShow less","all_details":"- Programming, installing, and troubleshooting Keyence vision systems within Panasonic’s battery manufacturing processes.\n- Providing machine-vision-related technical support to ongoing production operations.\n- Developing moving camera calibration algorithms.\n- Analyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods.\n- Determining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors.\n- Providing technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning.\n- Preparing or directing preparation of product or system layout and detailed drawings and schematics.\n- Other duties may be assigned.\n- To ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PENA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\n- Basic\/Required: Bachelor’s degree in Electrical Engineering, Mechanical Engineering, or related field\n- Preferred: None\n- Proficiency with XG-X, LI-V Keyence controllers.\n- Experience working with vision system databases.\n- Knowledge of camera, light, and lens selection for applications ranging from defect detection to part location.\n- Experience with quality and reliability improvement using data acquisition in conjunction with Six Sigma, Cpk, Gauge R&R, and similar quality tools.\n- Skilled in the utilization of statistical analysis.\n- Programming background with high-level languages such as C, C++, and Python.\n- Background working in a high-volume manufacturing environment.\n- Must have working-level knowledge of the English language, including reading, writing, and speaking English\n- Experience programming, installing, and troubleshooting PLC systems such as Mitsubishi and Omron.\n- Experience programming, installing, and troubleshooting Cognex manufacturing image vision systems.\n- Familiarity with wiring\/cabling size\/terminations and load\/temperature requirements.\n- Familiarity with industrial machinery design & related NFPA codes:\n- 70\n- 79 (and related UL standards for industrial machinery)\n- Alignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)\n- None\n- None\n- Sit: 40%\n- Walk: 30%\n- Stand: 20%\n- Lift: 10%\n- Up to 10 lbs.: Occasional\n- Up to 20 lbs.: Occasional\n- Up to 35 lbs.: Occasional\n- Team-lift only (over 35 lbs.): Not Required\n- Sit: 40%\n- Walk: 30%\n- Stand: 20%\n- Lift: 10%\n- Up to 10 lbs.: Occasional\n- Up to 20 lbs.: Occasional\n- Up to 35 lbs.: Occasional\n- Team-lift only (over 35 lbs.): Not Required\n- Highly inclusive and class-leading healthcare options to include family planning, mental health, and pet insurance\n- Employee assistance programs that support total well-being with complimentary session offered each and every month\n- Company-matched and fully vested 401K retirement program that starts immediately from date of enrollment\n- Annual bonus program, High5 employee recognition and awards platform, quarterly and annual employee recognition\n- Simplified access to self-guided and representative-supported short and long-term financial wellness and retirement planning\n- Educational Assistance & Reimbursement Program\n- Diversity, equity, and inclusion programs and associated employee resource groups that promote representation and belonging\n- Leadership, career, and mentorship development programs opportunities at all levels across the organization\n- Several on-site cafes, plentiful snack and beverage kitchens, revolving on-site vendor visits and employee events\n- Collaborative and motivating culture routed in continuous personal and professional growth and much more.\n- Shuttle rides to and from work!"}
{"job_id":"4215032841","company":"IGT","title":"Software Engineer II","location":"Reno, NV","date_posted":"22 minutes ago","applicants":"29 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Gambling Facilities and Casinos, Software Development, and IT Services and IT Consulting","company_website":null,"workplace_type":null,"description":"IGT (NYSE:IGT) is a global leader in gaming. We deliver entertaining and responsible gaming experiences for players across all channels and regulated segments, from Lotteries and Gaming Machines to Sports Betting and Digital. Leveraging a wealth of compelling content, substantial investment in innovation, player insights, operational expertise, and leading-edge technology, our solutions deliver unrivaled gaming experiences that engage players and drive growth. We have a well-established local presence and relationships with governments and regulators in more than 100 countries around the world, and create value by adhering to the highest standards of service, integrity, and responsibility. IGT has approximately 10,500 employees. For more information, please visit www.igt.com .\nOverview\nAs a member of the Game Platform Engineering team, you will be responsible for helping us deliver new features that enable world-class games on the IGT Ascent platform. The software you will be working on is the beating heart of casino and lottery gaming machines, managing everything from metering and configuration to systems interfaces using industry-standard protocols. Because of the wide scope of responsibility for this software system, you will have lots of opportunities to work on new and exciting features as well as help us to improve and modernize existing components.\nCandidates should be self-motivated, open to learning new technologies as well as sharing their knowledge with others, and always looking for the best technical solutions to complex problems.\nThe successful candidate will have good knowledge of the C++ and C# programming languages and have a good working knowledge of Unity game development. Utilize the latest language features to produce stable and performant code. Since our team sits at the heart of the Ascent platform, candidates should be strong communicators and able to interface and build relationships with people in other departments, including Hardware\/Electrical Engineering, Game Studios, Product Assurance, Compliance, Customer Service, Operations, Production, and other Engineering departments.\nThis position is ONSITE based in Reno, NV.\nResponsibilities\nDesign, code, unit test and debug software\nWrite or participate in code documentation\nSupport or conduct technical analyses to design and implement machine software, software applications or software tools that achieve the desired functionality\nParticipate in software peer code reviews\nWork with engineering managers\/technical leads and other immediate team members on product designs\nRequired Qualifications\nBachelor’s degree in Computer Science, Software Engineering, or equivalent degree program\n3+ years of experience in C++ and\/or C# and .NET software development\nExperience with Unity game development\nKnowledge of XML Schema and Interface Description Language (IDL)\nTime management skills\nKnowledge of version control management systems (Perforce and\/or Git)\nKnowledge of Continuous Integration (CI)\nCommunication skills\nProblem-solving skills\nProficient in English\nPreferred Qualification\nExperience in modern C++ techniques (C++17)\nExperience in C# 5\nExperience in .NET 4.8 or higher\nKeys to Success\nBuilding collaborative relationships\nDecision making\nDrive results\nFoster innovation\nPersonal energy\nSelf-leadership\nIGT is committed to sustaining a workforce that reflects the diversity of the global customers and communities we serve, creating a fair and inclusive culture that enables all our employees to feel valued, respected and engaged. IGT is an equal opportunity employer. We provide equal opportunities without regard to sex, race, color, religion, age, national origin or ancestry, disability, veteran status, sexual orientation, genetic information, gender identity or expression, and any other personal attributes protected by federal, state, or other laws. We thank all applicants for applying; however, only those selected to interview will be contacted.\nAt IGT, we consider a wide range of factors in determining compensation, including background, skills, experience, and work location. These factors can cause your compensation to vary. The estimated starting compensation range is $50,482 - $115,000. The actual pay offered may end up being higher or lower. The Company will comply with all local pay requirements and collective bargaining agreements, where applicable.\nBase pay is only one part of our Total Rewards program. Sales roles may be eligible for commission payments, while other roles are eligible for discretionary bonuses . In addition, we offer employees a 401(k) Savings Plan with Company contributions, health, dental, and vision insurance, life, accident, and disability insurance, tuition reimbursement, paid time off, wellness programs, and identity theft insurance. Note: programs are subject to eligibility requirements.\nAll IGT employees have a role in information security. Annual training will be assigned and required as appropriate.\nIGT (NYSE: IGT) is the global leader in gaming. For more information, please visit www.igt.com .\nShow more\nShow less","all_details":"- Design, code, unit test and debug software\n- Write or participate in code documentation\n- Support or conduct technical analyses to design and implement machine software, software applications or software tools that achieve the desired functionality\n- Participate in software peer code reviews\n- Work with engineering managers\/technical leads and other immediate team members on product designs\n- Bachelor’s degree in Computer Science, Software Engineering, or equivalent degree program\n- 3+ years of experience in C++ and\/or C# and .NET software development\n- Experience with Unity game development\n- Knowledge of XML Schema and Interface Description Language (IDL)\n- Time management skills\n- Knowledge of version control management systems (Perforce and\/or Git)\n- Knowledge of Continuous Integration (CI)\n- Communication skills\n- Problem-solving skills\n- Proficient in English\n- Experience in modern C++ techniques (C++17)\n- Experience in C# 5\n- Experience in .NET 4.8 or higher\n- Building collaborative relationships\n- Decision making\n- Drive results\n- Foster innovation\n- Personal energy\n- Self-leadership"}
{"job_id":"4224180084","company":"CGS Federal (Contact Government Services)","title":"Java Developer","location":"Las Vegas, NV","date_posted":"1 month ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Hospitality, Food and Beverage Services, and Retail","company_website":null,"workplace_type":null,"description":"Employment Type: Full-Time\nDepartment: Information Technology\nCGS is seeking a Java developer\/programmer to join a team working on the enhancement of data utilization for a large, state-run project. The developer will be asked to aggregate data from several different existing sources and prepare plans for how this data can be collected, processed, stored, and reported on. The candidate for this position should have a strong understanding of large-scale enterprise systems and have a demonstrated expert knowledge of Java coding and web applications including Java Server Faces Framework.\nCGS brings motivated, highly skilled, and creative people together to solve the government’s most dynamic problems with cutting edge technology. To carry out our mission, we are seeking candidates that are excited to contribute to government innovation, appreciate collaboration, and can anticipate the needs of others. Here at CGS, we offer an environment in which our employees feel supported, and we encourage professional growth through various learning opportunities.\nSkills and attributes for success:\nCollaborate with business analyst and developers to produce software designs\nProvide work estimates to project manager, provide frequent status updates and track progress against the project work plan\nFormulate program specifications and basic prototypes\nTransform software designs and specifications into high functioning code in the appropriate language\nIntegrate individual software solutions to higher level systems\nUse web-based tools to create and advance applications\nTest code periodically to ensure it produces the desirable results and perform debugging when necessary\nCollaborate with business, development, and QA teams to develop testing and acceptance procedures\nPerform upgrades to make software and systems more secure and efficient\nCollaborate with business analyst to provide training, knowledge transfer, and documentation for user support\nQualifications:\nThree (3) Years of experience developing Java web applications using the Java Server Faces Framework\nFive (5) Years of experience in Java web application user interface design and implementation including HTML, CSS, and Javascript\nThree (3) Years of experience integrating Java web applications with SQL databases using Hibernate\nThree (3) Years of SQL relational database design and coding experience\nFive (5) Years of experience developing software both independently and in a team environment\nAbility to demonstrate superior organizational skills with an acute attention to detail\nAbility to work effectively under pressure in time-sensitive situations and prioritize multiple projects with similar deadlines\nOur commitment:\nContact Government Services (CGS) strives to simplify and enhance government bureaucracy through the optimization of human, technical, and financial resources. We combine cutting edge technology with world-class personnel to deliver customized solutions that fit our clients’ specific needs. We are committed to solving the most challenging and dynamic problems.\nFor the past seven years we’ve been growing our government-contracting portfolio, and along the way we’ve created valuable partnerships by demonstrating a commitment to honesty, professionalism, and quality work.\nHere at CGS we value honesty through hard work and self-awareness, professionalism in all we do, and to deliver the best quality to our consumers mending those relations for years to come.\nWe care about our employees. Therefore, we offer a comprehensive benefits package:\nHealth, Dental, and Vision\nLife Insurance\n401k\nFlexible Spending Account (Health, Dependent Care, and Commuter)\nPaid Time Off and Observance of State\/Federal Holidays\nContact Government Services, LLC is an Equal Opportunity Employer. Applicants will be considered without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran\nJoin our team and become part of meaningful government innovation!\nExplore additional job opportunities with CGS on our Job Board:\nhttps:\/\/cgsfederal.com\/join-our-team\/\nFor more information about CGS please visit: https:\/\/www.cgsfederal.com or contact:\nEmail: info@cgsfederal.com\nShow more\nShow less","all_details":"- Collaborate with business analyst and developers to produce software designs\n- Provide work estimates to project manager, provide frequent status updates and track progress against the project work plan\n- Formulate program specifications and basic prototypes\n- Transform software designs and specifications into high functioning code in the appropriate language\n- Integrate individual software solutions to higher level systems\n- Use web-based tools to create and advance applications\n- Test code periodically to ensure it produces the desirable results and perform debugging when necessary\n- Collaborate with business, development, and QA teams to develop testing and acceptance procedures\n- Perform upgrades to make software and systems more secure and efficient\n- Collaborate with business analyst to provide training, knowledge transfer, and documentation for user support\n- Three (3) Years of experience developing Java web applications using the Java Server Faces Framework\n- Five (5) Years of experience in Java web application user interface design and implementation including HTML, CSS, and Javascript\n- Three (3) Years of experience integrating Java web applications with SQL databases using Hibernate\n- Three (3) Years of SQL relational database design and coding experience\n- Five (5) Years of experience developing software both independently and in a team environment\n- Ability to demonstrate superior organizational skills with an acute attention to detail\n- Ability to work effectively under pressure in time-sensitive situations and prioritize multiple projects with similar deadlines\n- Health, Dental, and Vision\n- Life Insurance\n- 401k\n- Flexible Spending Account (Health, Dependent Care, and Commuter)\n- Paid Time Off and Observance of State\/Federal Holidays"}
{"job_id":"4211854460","company":"Synoptek","title":"Application Developer III","location":"Las Vegas, NV","date_posted":"12 hours ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"IT Services and IT Consulting","company_website":null,"workplace_type":null,"description":"Overview\nSynoptek\nWe think globally, act locally. As a Managed Services Provider Synoptek provides world-class strategic IT leadership and hyper-efficient IT operational support, enabling our global client-base to grow and transform their businesses. We are excited to have experienced continuous growth and in keeping with that momentum are seeking to add talent to our team. When you partner with Synoptek, you engage with an ever-growing, ever-evolving IT organization that provides a high-caliber team, result, growth and clarity.\nApplication Developer III\nThis is an amazing opportunity to work within the fastest growing Managed Services Provider in the nation. We are a company with a heart and soul dedicated to the ongoing success and growth of our employees and continued business success of the customers we support. We foster a fun and connected environment with employee benefits extending beyond general compensation and into company sponsored events and an invested culture of learning.\nThe Application Developer III is responsible for designing, developing, and maintaining high-performance applications and collaborating with cross-functional teams, including designers, product managers, and other developers. Additionally, the role involves analyzing user needs, designing innovative solutions, and implementing robust applications that enhance user experience and meet business objectives.\nThe successful candidate will play a pivotal role in ensuring the performance, quality, and responsiveness of applications, applying best practices in software development, conducting thorough testing, and collaborating with QA teams to address and resolve reported issues. Moreover, the Application Developer III will work closely with clients, offering expertise in development and testing best practices.\nDuties And Responsibilities\nCode and develop scalable and secure applications, employing active testing methodologies\nCreate comprehensive documentation, ensuring clarity and transparency in all development processes\nProvide informed recommendations on best practices within coding, testing, and application design\nTake the lead in shaping and optimizing application design strategies for enhanced performance\nDemonstrate proven experience as an Application Developer, showcasing proficiency primarily in .net as well as in C#, Python, and other relevant programming languages\nNavigate front-end and back-end development frameworks, including React, Angular, and node.js\nExhibit familiarity with diverse database management systems such as MSSQL, MySQL, MongoDB, and Relationship databases\nApply knowledge of web services and RESTful APIs to deliver effective solutions\nShowcase excellent problem-solving and analytical skills, addressing complex issues in existing applications\nCollaborate seamlessly with cross-functional teams, playing a pivotal role in translating user needs into innovative solutions\nWork within Agile and waterfall methodologies, adapting to industry trends and emerging technologies\nCreate and maintain detailed technical documentation for applications, APIs, and other development-related artifacts\nConduct thorough testing to ensure the reliability and robustness of developed applications\nCollaborate with QA teams to address and resolve reported issues, ensuring quality assurance\nEngage in effective communication with clients, providing consulting on best practices for development and testing\nAnalyze user needs and design innovative solutions using the software development cycle\nTake the lead on software development projects, ensuring successful planning, implementation, and deployment\nProvide leadership and supervision to other team members, contributing to a collaborative and growth-oriented environment\nTest software solutions rigorously, ensuring they meet high standards of reliability and performance\nDocument software programs meticulously with flowcharts, layouts, charts, diagrams, and other comprehensive documentation\nStay abreast of developments in the field, continuously learning and adapting to the latest advancements\nThis job description is not designed to be a comprehensive list of the duties and responsibilities required of the employee in this position, as duties, responsibilities, and activities may change at anytime with or without notice\nEducation\nBachelor’s degree in Computer Science from an accredited college or university\nIn lieu of undergraduate degree, the ratio is 1:1 - meaning one year of college equals one year of work experience and vice versa\nExperience\nCustomarily has at least 7 years of experience in designing and developing based applications with preferably with .net\/C# with Angular\/REACT utilizing REST API\nSkills\/Attributes\nSynoptek core DNA behaviors:\nClarity: Possesses excellent communication skills, makes a concentrated effort to speak the customer’s language. Ability to field questions with concise, well-constructed responses\nOwnIT: Shows integrity, innovation, and accountability in completing daily assignments\nResults: Solutions focused and driven to resolve conflict quickly and precisely. Proactively looks for opportunities to contribute to the company’s business goals\nGrowth: Willing to learn and ask questions. Constantly looking for new ways to improve yourself. Ability to adapt and grow in a fast-paced environment\nTeam: Embraces both customers and colleagues as team members. Ability to be flexible, respectful, engaged and collaborative\nAbility to understand business requirements and translate them into technical requirements\nStrong knowledge and experience in SQL and a relational database, including the design and use of JSON, etc.\nFamiliarity with code versioning tools, such as Azure DevOps, GitHub, etc.\nStrong object-oriented design and development skills\nAbility to provide thought leadership while working closely with Consulting, AppDev, BI teams, BDMs and CAs for pre-sales\nAbility to understand and prioritize the client’s technology needs and drive continuous improvement, user adoption, and business process maturity across different business functions\nAbility to influence stakeholders and work closely with them to determine acceptable solutions\nAdvanced technical skills and proven history of leading and supporting successful projects\nWorking Conditions\nWe live by the motto ‘work hard, play hard’ and strive to support our employees in both their professional and personal goals. We believe that by hiring the right people, leading process improvement, and leveraging technology, we achieve superior results.\nWork is performed primarily in an office or remote environment. Final location determined by business need. May be subject to time constraints and tight deadlines. May require occasional travel.\nEEO Statement\nWe are proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, veteran status, sexual orientation, gender identity, marital status, pregnancy, genetic information, or any other characteristic protected by law and will not be discriminated against on the basis of disability. It is our intention that all qualified applicants are given equal opportunity and that employment decisions be based on job-related factors.\nShow more\nShow less","all_details":"- Code and develop scalable and secure applications, employing active testing methodologies\n- Create comprehensive documentation, ensuring clarity and transparency in all development processes\n- Provide informed recommendations on best practices within coding, testing, and application design\n- Take the lead in shaping and optimizing application design strategies for enhanced performance\n- Demonstrate proven experience as an Application Developer, showcasing proficiency primarily in .net as well as in C#, Python, and other relevant programming languages\n- Navigate front-end and back-end development frameworks, including React, Angular, and node.js\n- Exhibit familiarity with diverse database management systems such as MSSQL, MySQL, MongoDB, and Relationship databases\n- Apply knowledge of web services and RESTful APIs to deliver effective solutions\n- Showcase excellent problem-solving and analytical skills, addressing complex issues in existing applications\n- Collaborate seamlessly with cross-functional teams, playing a pivotal role in translating user needs into innovative solutions\n- Work within Agile and waterfall methodologies, adapting to industry trends and emerging technologies\n- Create and maintain detailed technical documentation for applications, APIs, and other development-related artifacts\n- Conduct thorough testing to ensure the reliability and robustness of developed applications\n- Collaborate with QA teams to address and resolve reported issues, ensuring quality assurance\n- Engage in effective communication with clients, providing consulting on best practices for development and testing\n- Analyze user needs and design innovative solutions using the software development cycle\n- Take the lead on software development projects, ensuring successful planning, implementation, and deployment\n- Provide leadership and supervision to other team members, contributing to a collaborative and growth-oriented environment\n- Test software solutions rigorously, ensuring they meet high standards of reliability and performance\n- Document software programs meticulously with flowcharts, layouts, charts, diagrams, and other comprehensive documentation\n- Stay abreast of developments in the field, continuously learning and adapting to the latest advancements\n- This job description is not designed to be a comprehensive list of the duties and responsibilities required of the employee in this position, as duties, responsibilities, and activities may change at anytime with or without notice\n- Bachelor’s degree in Computer Science from an accredited college or university\n- In lieu of undergraduate degree, the ratio is 1:1 - meaning one year of college equals one year of work experience and vice versa\n- Customarily has at least 7 years of experience in designing and developing based applications with preferably with .net\/C# with Angular\/REACT utilizing REST API\n- Synoptek core DNA behaviors:\n- Clarity: Possesses excellent communication skills, makes a concentrated effort to speak the customer’s language. Ability to field questions with concise, well-constructed responses\n- OwnIT: Shows integrity, innovation, and accountability in completing daily assignments\n- Results: Solutions focused and driven to resolve conflict quickly and precisely. Proactively looks for opportunities to contribute to the company’s business goals\n- Growth: Willing to learn and ask questions. Constantly looking for new ways to improve yourself. Ability to adapt and grow in a fast-paced environment\n- Team: Embraces both customers and colleagues as team members. Ability to be flexible, respectful, engaged and collaborative\n- Ability to understand business requirements and translate them into technical requirements\n- Strong knowledge and experience in SQL and a relational database, including the design and use of JSON, etc.\n- Familiarity with code versioning tools, such as Azure DevOps, GitHub, etc.\n- Strong object-oriented design and development skills\n- Ability to provide thought leadership while working closely with Consulting, AppDev, BI teams, BDMs and CAs for pre-sales\n- Ability to understand and prioritize the client’s technology needs and drive continuous improvement, user adoption, and business process maturity across different business functions\n- Ability to influence stakeholders and work closely with them to determine acceptable solutions\n- Advanced technical skills and proven history of leading and supporting successful projects"}
{"job_id":"4208138963","company":"Panasonic Audio Video Solutions","title":"Vision Engineer I","location":"Sparks, NV","date_posted":"4 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Appliances, Electrical, and Electronics Manufacturing","company_website":null,"workplace_type":null,"description":"Overview\nDo you want to join a team that's changing the world? Do you have a strong background as a Vision Engineer I? Then we're looking for you! Check out the job description and apply now! Put your skills to meaningful use, gain unique experience, and work with world-class team members with diverse backgrounds and expertise who share the same vision. Join the PENA team today!\nResponsibilities\nMeet Panasonic\nMeet the Recruiter: Joe Richie\nExplore Panasonic Careers\nPanasonic Video Our Mission: Create Technologies That Move Us\nJob Title:\nVision Engineer I\nDepartment:\nManufacturing Engineering\nJob Summary:\nPanasonic Energy Corporation of North America is collaborating with Tesla Motors, Inc. in a large-scale advanced battery manufacturing facility known as the Gigafactory near Reno, Nevada which is known for its quality of life and expansive outdoor adventures. Panasonic manufactures and supplies cylindrical lithium-ion cells for the world’s leading electric vehicle manufacturer, Tesla Motors, Inc. Based on the battery demand from Tesla, the Gigafactory plans to produce cells which will double the world’s current production.\nOur mission at PECNA is to make the vision of affordable Electric Vehicles a reality by production of the world’s safest, highest-quality, and lowest-cost batteries. Through this effort we will create a clean energy society and our products will change society’s use of and perceptions of electric power.\nEssential Duties:\nProgramming, installing, and troubleshooting Keyence vision systems within Panasonic’s battery manufacturing processes.\nProviding machine-vision-related technical support to ongoing production operations.\nDeveloping moving camera calibration algorithms.\nAnalyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods.\nDetermining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors.\nProviding technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning.\nPreparing or directing preparation of product or system layout and detailed drawings and schematics.\nOther duties may be assigned.\nPersonal Protective Equipment (PPE) Requirements:\nTo ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PENA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\nThe foregoing description is not intended and should not be construed to be an exhaustive list of all responsibilities, skills and efforts or work conditions associated with the job. It is intended to be an accurate reflection of the general nature and level of the job.\nQualifications\nEducation:\nBasic\/Required: Bachelor’s degree in Electrical Engineering, Mechanical Engineering, or related field\nPreferred: None\nEssential Qualifications:\nProficiency with XG-X, LI-V Keyence controllers.\nExperience working with vision system databases.\nKnowledge of camera, light, and lens selection for applications ranging from defect detection to part location.\nExperience with quality and reliability improvement using data acquisition in conjunction with Six Sigma, Cpk, Gauge R&R, and similar quality tools.\nSkilled in the utilization of statistical analysis.\nProgramming background with high-level languages such as C, C++, and Python.\nBackground working in a high-volume manufacturing environment.\nMust have working-level knowledge of the English language, including reading, writing, and speaking English\nPreferred Qualifications:\nExperience programming, installing, and troubleshooting PLC systems such as Mitsubishi and Omron.\nExperience programming, installing, and troubleshooting Cognex manufacturing image vision systems.\nFamiliarity with wiring\/cabling size\/terminations and load\/temperature requirements.\nFamiliarity with industrial machinery design & related NFPA codes:\n70\n79 (and related UL standards for industrial machinery)\nAlignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)\nPreferred License(s):\nNone\nPreferred Certification(s):\nNone\nPhysical Demands:\nPhysical Activities: (Percentage of time (equaling 100%) during the normal workday the employee is required to)\nSit: 40%\nWalk: 30%\nStand: 20%\nLift: 10%\nRequired Lifting and Carrying: (Required frequency is: Not required (0%), Occasional (1-33%), Frequent (34-66%, Continuous (67-100%)\nUp to 10 lbs.: Occasional\nUp to 20 lbs.: Occasional\nUp to 35 lbs.: Occasional\nTeam-lift only (over 35 lbs.): Not Required\nPhysical Demands\n:\nPhysical Activities:\n(Percentage of time (equaling 100%) during the normal workday the employee is required to)\nSit: 40%\nWalk: 30%\nStand: 20%\nLift: 10%\nRequired Lifting and Carrying:\n(Required frequency is: Not required (0%), Occasional (1-33%), Frequent (34-66%, Continuous (67-100%)\nUp to 10 lbs.: Occasional\nUp to 20 lbs.: Occasional\nUp to 35 lbs.: Occasional\nTeam-lift only (over 35 lbs.): Not Required\nBenefits & Perks - What's In It For You:\nPanasonic Energy prioritizes total well-being and offers comprehensive benefits options to support physical, emotional, financial, social, and environmental health:\nHighly inclusive and class-leading healthcare options to include family planning, mental health, and pet insurance\nEmployee assistance programs that support total well-being with complimentary session offered each and every month\nCompany-matched and fully vested 401K retirement program that starts immediately from date of enrollment\nAnnual bonus program, High5 employee recognition and awards platform, quarterly and annual employee recognition\nSimplified access to self-guided and representative-supported short and long-term financial wellness and retirement planning\nEducational Assistance & Reimbursement Program\nDiversity, equity, and inclusion programs and associated employee resource groups that promote representation and belonging\nLeadership, career, and mentorship development programs opportunities at all levels across the organization\nSeveral on-site cafes, plentiful snack and beverage kitchens, revolving on-site vendor visits and employee events\nCollaborative and motivating culture routed in continuous personal and professional growth and much more.\nShuttle rides to and from work!\nWhere You'll Be:\nFor our onsite roles, Panasonic Energy is committed to fostering an ideal working environment that goes beyond the conventional. We understand the significance of moments that matter in your onsite experience, and we prioritize creating a workspace that not only promotes productivity but also ensures a fulfilling and positive work atmosphere. Join us at Panasonic Energy, where your onsite presence is valued, and we strive to make each moment count in your professional journey.\nWho We Are:\nMeet Panasonic Energy! At Panasonic Energy, you'll do work that matters as we are dedicated to transforming the world through the acceleration of sustainable energy. By producing safe, high-quality lithium-ion batteries, you become part of a team that plays a crucial role in creating technologies that move us.\nOur journey began in 2017, and now, as the world's largest lithium-ion battery factory, we are expanding operations to De Soto, Kansas, providing you with the opportunity to experience career growth in more ways than one.\nAs an innovative thinker, you'll thrive here, as we continually push the boundaries of lithium-ion battery technology and production capabilities to enhance efficiency and performance in EVs.\nBeing part of Panasonic Energy means positively contributing to society, aligning with our commitment to building a better world through sustainable energy solutions.\nWe care about what you care about, fostering an environment where your contributions make a meaningful impact on the future of energy and transportation. Join us and be part of a team that values your work, encourages innovation, and actively contributes to a positive societal impact.\nIn addition to an environment that is as innovative as our products, we offer competitive salaries and benefits.\nWe Take Opportunity Seriously:\nAt Panasonic Energy, we are committed to a workplace that genuinely fosters inclusion and belonging. Fairness and Honesty have been part of our core values for more than 100 years and we are proud of our diverse culture as an equal opportunity employer.\nWe understand that your career search may look different than others and embrace the professional, personal, educational, and volunteer opportunities through which people gain experience. If you are actively looking or starting to explore new opportunities, submit your application!\nSupplemental Information:\nPre-employment drug testing is required. Qualified applicants will receive consideration for employment without regard to characteristics protected by law.\nDue to the high volume of responses, we will only be able to respond to candidates of interest. All candidates must have valid authorization to work in the U.S. without restriction.\nThank you for your interest in Panasonic Energy Corporation of North America.\nR-100551\nShow more\nShow less","all_details":"- Programming, installing, and troubleshooting Keyence vision systems within Panasonic’s battery manufacturing processes.\n- Providing machine-vision-related technical support to ongoing production operations.\n- Developing moving camera calibration algorithms.\n- Analyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods.\n- Determining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors.\n- Providing technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning.\n- Preparing or directing preparation of product or system layout and detailed drawings and schematics.\n- Other duties may be assigned.\n- To ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PENA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\n- Basic\/Required: Bachelor’s degree in Electrical Engineering, Mechanical Engineering, or related field\n- Preferred: None\n- Proficiency with XG-X, LI-V Keyence controllers.\n- Experience working with vision system databases.\n- Knowledge of camera, light, and lens selection for applications ranging from defect detection to part location.\n- Experience with quality and reliability improvement using data acquisition in conjunction with Six Sigma, Cpk, Gauge R&R, and similar quality tools.\n- Skilled in the utilization of statistical analysis.\n- Programming background with high-level languages such as C, C++, and Python.\n- Background working in a high-volume manufacturing environment.\n- Must have working-level knowledge of the English language, including reading, writing, and speaking English\n- Experience programming, installing, and troubleshooting PLC systems such as Mitsubishi and Omron.\n- Experience programming, installing, and troubleshooting Cognex manufacturing image vision systems.\n- Familiarity with wiring\/cabling size\/terminations and load\/temperature requirements.\n- Familiarity with industrial machinery design & related NFPA codes:\n- 70\n- 79 (and related UL standards for industrial machinery)\n- Alignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)\n- None\n- None\n- Sit: 40%\n- Walk: 30%\n- Stand: 20%\n- Lift: 10%\n- Up to 10 lbs.: Occasional\n- Up to 20 lbs.: Occasional\n- Up to 35 lbs.: Occasional\n- Team-lift only (over 35 lbs.): Not Required\n- Sit: 40%\n- Walk: 30%\n- Stand: 20%\n- Lift: 10%\n- Up to 10 lbs.: Occasional\n- Up to 20 lbs.: Occasional\n- Up to 35 lbs.: Occasional\n- Team-lift only (over 35 lbs.): Not Required\n- Highly inclusive and class-leading healthcare options to include family planning, mental health, and pet insurance\n- Employee assistance programs that support total well-being with complimentary session offered each and every month\n- Company-matched and fully vested 401K retirement program that starts immediately from date of enrollment\n- Annual bonus program, High5 employee recognition and awards platform, quarterly and annual employee recognition\n- Simplified access to self-guided and representative-supported short and long-term financial wellness and retirement planning\n- Educational Assistance & Reimbursement Program\n- Diversity, equity, and inclusion programs and associated employee resource groups that promote representation and belonging\n- Leadership, career, and mentorship development programs opportunities at all levels across the organization\n- Several on-site cafes, plentiful snack and beverage kitchens, revolving on-site vendor visits and employee events\n- Collaborative and motivating culture routed in continuous personal and professional growth and much more.\n- Shuttle rides to and from work!"}
{"job_id":"4228836844","company":"Contemporary Amperex Technology Kentucky LLC","title":"IT- Systems Engineer - Corporate System","location":"Reno, NV","date_posted":"1 day ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Manufacturing","industries":"Motor Vehicle Manufacturing","company_website":null,"workplace_type":null,"description":"About Us\nContemporary Amperex Technology Co., Limited (CATL) is a global leader in the development and manufacturing of EV batteries, with businesses covering R&D, manufacturing and sales in battery systems for new energy vehicles and energy storage systems. The company is committed to providing cutting-edge solutions for global new energy applications.\nTo better serve the global auto industry electric vehicle trend in the United States, CATL, through its U.S.-based subsidiary, CATK, is seeking a talented and experienced IT Systems Engineer to join our local team. As an IT Systems Engineer at CATK, you will play a key role in integrating and optimizing enterprise systems such as QMS, QIS, xQC (Above three applications are quality management system), UAA( Unified Authentication Account) , SSOT (Single Source of Truth Master data management ), BPM (Business process management) , Mobile Apps and others. You will be responsible for demand analysis, system design, implementation, troubleshooting, and performance optimization. Additionally, you will oversee the construction, maintenance, and support of operation systems and mobile applications, providing technical expertise and ensuring seamless functionality.\nOur Vision\nStrive to be a global premier innovative technology corporation, deliver excellent contribution to green energy resolution and provide a platform of pursuing the spiritual and material well-being for employees.\nJob Description\nLead the demand analysis, scheme design, and implementation promotion of QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other enterprise systems to meet business requirements and enhance operational efficiency.\nTroubleshoot and optimize performance of QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other systems to ensure reliability and effectiveness.\nDevelop and maintain operation systems and mobile phone applications,including construction, operation, maintenance, and technical support.\nCollaborate with cross-functional teams to integrate business requirements with information systems, improving overall business performance and user satisfaction.\nEnsure seamless database operation, configuration, and maintenance, leveraging proficiency in programming languages such as Python, C\/C++, Java, or JavaScript as needed.\nDocument system configurations, procedures, and best practices to facilitate knowledge sharing and support continuous improvement initiatives.\nQualifications\nBachelor’s degree in Computer Science, Information Technology, Engineering, or a related field.\nProven experience in integrating and optimizing QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other enterprise systems in a manufacturing environment.\nStrong understanding of business systems and logic, with the ability to align technology solutions with business objectives.\nProficiency in at least one programming language (Python, C\/C++, Java, JavaScript, etc.) and database operations.\nExperience in system troubleshooting, performance optimization, and maintenance.\nExcellent communication skills and ability to collaborate effectively with cross-functional teams and stakeholders.\nAbility to maintain a full-time work schedule with regular in-person attendance is required for this position.\nAbility to interact professionally with individuals of varied backgrounds and skill level.\n[CATK] is an Equal Opportunity Employer.\nAll qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law. [CATK] complies with federal and state disability laws and makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and\/or to receive other benefits and privileges of employment, please contact yiminghuang@catl.com\nShow more\nShow less","all_details":"About Us\nContemporary Amperex Technology Co., Limited (CATL) is a global leader in the development and manufacturing of EV batteries, with businesses covering R&D, manufacturing and sales in battery systems for new energy vehicles and energy storage systems. The company is committed to providing cutting-edge solutions for global new energy applications.\nTo better serve the global auto industry electric vehicle trend in the United States, CATL, through its U.S.-based subsidiary, CATK, is seeking a talented and experienced IT Systems Engineer to join our local team. As an IT Systems Engineer at CATK, you will play a key role in integrating and optimizing enterprise systems such as QMS, QIS, xQC (Above three applications are quality management system), UAA( Unified Authentication Account) , SSOT (Single Source of Truth Master data management ), BPM (Business process management) , Mobile Apps and others. You will be responsible for demand analysis, system design, implementation, troubleshooting, and performance optimization. Additionally, you will oversee the construction, maintenance, and support of operation systems and mobile applications, providing technical expertise and ensuring seamless functionality.\nOur Vision\nStrive to be a global premier innovative technology corporation, deliver excellent contribution to green energy resolution and provide a platform of pursuing the spiritual and material well-being for employees.\nJob Description\n- Lead the demand analysis, scheme design, and implementation promotion of QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other enterprise systems to meet business requirements and enhance operational efficiency.\n- Troubleshoot and optimize performance of QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other systems to ensure reliability and effectiveness.\n- Develop and maintain operation systems and mobile phone applications,including construction, operation, maintenance, and technical support.\n- Collaborate with cross-functional teams to integrate business requirements with information systems, improving overall business performance and user satisfaction.\n- Ensure seamless database operation, configuration, and maintenance, leveraging proficiency in programming languages such as Python, C\/C++, Java, or JavaScript as needed.\n- Document system configurations, procedures, and best practices to facilitate knowledge sharing and support continuous improvement initiatives.\nQualifications\n- Bachelor’s degree in Computer Science, Information Technology, Engineering, or a related field.\n- Proven experience in integrating and optimizing QMS, QIS, xQC, UAA, SSOT, BPM, Mobile Apps and other enterprise systems in a manufacturing environment.\n- Strong understanding of business systems and logic, with the ability to align technology solutions with business objectives.\n- Proficiency in at least one programming language (Python, C\/C++, Java, JavaScript, etc.) and database operations.\n- Experience in system troubleshooting, performance optimization, and maintenance.\n- Excellent communication skills and ability to collaborate effectively with cross-functional teams and stakeholders.\n- Ability to maintain a full-time work schedule with regular in-person attendance is required for this position.\n- Ability to interact professionally with individuals of varied backgrounds and skill level.\n[CATK] is an Equal Opportunity Employer.All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law. [CATK] complies with federal and state disability laws and makes reasonable accommodations for applicants and employees with disabilities. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and\/or to receive other benefits and privileges of employment, please contact yiminghuang@catl.com"}
{"job_id":"4124985899","company":"Gaming Laboratories International, LLC","title":"Test Engineer I - LV","location":"Las Vegas, NV","date_posted":"1 week ago","applicants":"104 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Gambling Facilities and Casinos","company_website":null,"workplace_type":null,"description":"Location: Las Vegas, NV\nWhile providing integrity to the casino and gambling industry for over 35 years, GLI has established an incomparable team of professionals. The\nTest Engineer\nis responsible for testing software and hardware designs that impact the products and services across all areas within the gambling industry.\nHave you ever wondered how sports betting or online gambling works? GLI's team of engineers help protect casino and gambling markets around the world by thoroughly testing products to identify potential problems and defects, optimizing quality, and ensuring regulatory compliance.\nWho We Are…\nWith over 35 years in the industry, Gaming Laboratories International is the global leader in the testing and certification of gaming devices and systems. We are proud of our stability and our history of world-class customer service delivery to more than 480 jurisdictions worldwide.\nWhy You Should Work Here…\nOur employees are at the heart of everything we do, which is why they are our biggest investment. We offer competitive salaries, top-notch benefits and a company culture focused on employee development and career enhancement. Our team members have the opportunity to communicate and collaborate with colleagues around the world.\nWhat You Will Accomplish Here…\nThe Engineering team at GLI tests software and hardware designs that impact the products and services across all areas within the gambling industry. We are searching for an entry level Test Engineer in our NV office to join our team. The Test Engineer’s main focus will be on the following:\nEfficiently Evaluating And Executing Tests By\nDeveloping an understanding of technical requirements\/regulations\nDeveloping an understanding of client’s expectations and additional testing requests\nResearching, identifying and applying any special rules or other requirements\nAccurately developing and executing test methods for technical and client requirements\nEffectively documenting test results and discovered defects\nManaging projects and tasks against budgets and timelines\nCommunicating And Coordinating With Clients By\nDeveloping and maintaining professional relationships with all assigned customers\nMaintaining an understanding of the customer's needs and market position\nProactively communicating the status of testing with all relevant internal and external parties\nExperience, Education, Skills and Credentials: .\nAssociate degree in engineering, science or math, or 2+ years of equivalent working experience\nBachelor’s Degree or 4 years equivalent experience in engineering, science, math or other technical areas strongly preferred\nCertification, formal training or experience may also be evaluated and considered in lieu of educational requirements\nValid Driver’s License required\nKnowledge of C++ or other modern, object-oriented programming language(s) is required\nWorking knowledge of Microsoft Word and Excel is required\nMust be able to read, write and speak English fluently\nMust have excellent interpersonal skills, including the ability to effectively and professionally speak orally and in writing with both internal and external parties\nMust demonstrate a high degree of attention to quality, details, correctness and deadlines\nMust be able to pass a thorough background investigation\nLocation:\nOn-site in our Las Vegas, NV Office\nSchedule:\nNormal hours are Monday through Friday, 40 hours per week.\nSalary:\n$29.24 h\/r ($60,830 annually)\nBenefits\nComprehensive Health, Dental, and Vision Insurance\nOptional Health and Flexible Savings Accounts\n100% Employer Paid Life and Disability Insurance\n20 Days Paid Time Off (per year)\n401K Savings Plan with 100% match up to 3% of your salary\nAnnual Discretionary Bonus\nAnniversary Reward Bonus\nEducational Assistance Program\nAdditional Mental Health Benefits through our Employee Assistance Program\nVoluntary Pet, Accident, and Critical Event Insurance\nGaming Laboratories International (GLI) is a gaming company. Any of our employees may be required to obtain a gaming license within one or all of the gaming jurisdictions. If you are requested by GLI to obtain a gaming license, your continued employment may be contingent on your ability to obtain that gaming license.\nThis job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The incumbent may be requested to perform other job-related task and responsibilities than those stated above.\nGLI is an Equal Opportunity Employer\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status.\nApply Now\nShow more\nShow less","all_details":"- Developing an understanding of technical requirements\/regulations\n- Developing an understanding of client’s expectations and additional testing requests\n- Researching, identifying and applying any special rules or other requirements\n- Accurately developing and executing test methods for technical and client requirements\n- Effectively documenting test results and discovered defects\n- Managing projects and tasks against budgets and timelines\n- Developing and maintaining professional relationships with all assigned customers\n- Maintaining an understanding of the customer's needs and market position\n- Proactively communicating the status of testing with all relevant internal and external parties\n- Associate degree in engineering, science or math, or 2+ years of equivalent working experience\n- Bachelor’s Degree or 4 years equivalent experience in engineering, science, math or other technical areas strongly preferred\n- Certification, formal training or experience may also be evaluated and considered in lieu of educational requirements\n- Valid Driver’s License required\n- Knowledge of C++ or other modern, object-oriented programming language(s) is required\n- Working knowledge of Microsoft Word and Excel is required\n- Must be able to read, write and speak English fluently\n- Must have excellent interpersonal skills, including the ability to effectively and professionally speak orally and in writing with both internal and external parties\n- Must demonstrate a high degree of attention to quality, details, correctness and deadlines\n- Must be able to pass a thorough background investigation\n- Comprehensive Health, Dental, and Vision Insurance\n- Optional Health and Flexible Savings Accounts\n- 100% Employer Paid Life and Disability Insurance\n- 20 Days Paid Time Off (per year)\n- 401K Savings Plan with 100% match up to 3% of your salary\n- Annual Discretionary Bonus\n- Anniversary Reward Bonus\n- Educational Assistance Program\n- Additional Mental Health Benefits through our Employee Assistance Program\n- Voluntary Pet, Accident, and Critical Event Insurance"}
{"job_id":"4229149579","company":"Pearson","title":"Senior Software Developer","location":"Carson City, NV","date_posted":"15 hours ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Education Administration Programs and E-Learning Providers","company_website":null,"workplace_type":null,"description":"Job Title:\nSenior Software Fullstack Developer\nDivision:\nAssessment & Qualifications\nLocation:\nUS - Remote\nJob Type:\nFull-Time\nAbout Pearson\nLearning is no longer just a stage of life but a lifelong journey. In an era where AI is moving at breathtaking pace and where there is huge demand for new talent, with new skills, the world needs learning more than ever before.\nWhether it’s upskilling in the workplace, developing a team, getting ahead in school, making the grade at university, or learning a new language, millions of people around the world trust Pearson products and services to help them realise the life they imagine through learning.\nWe hold learners, educators, and enterprises at the heart of our thinking. Our five interconnected business divisions work together to meet people’s evolving learning needs. We’re proud to be a trusted partner in the moments that matter throughout their lives.\nThe Team!\nThis requisition is part of the Innovation and Technology Enablement team which develops innovative assessment technology platforms. One of the team’s primary responsibilities is supporting a number of technology platforms that deliver exams to test takers, score and report results. We are now in the midst of building our next generation assessment platform, which is a multi-year project with enormous strategic value, leveraging state of the art technologies and processes. We are looking for outstanding candidates to bolster the staff of this critical project.\nWe are building a brand-new team of Senior Software Developers that thrive on developing cutting edge applications, with a passion for innovation and pride in producing excellent user experiences. Our work environment is collaborative, casual, flexible, agile and results driven. Since the business provides a mission-critical service to a demanding set of clients, high-quality performance is required to meet customer expectations.\nThe Senior Full Stack Engineer Will\nBe responsible for analysis, design, implementation, and unit testing to produce high-quality code for a project team responsible for supporting a number of cutting-edge assessment technology platforms. They will use industry best practices while working in a team of high-performing professionals. They are also responsible for maintaining and supporting mission-critical applications as necessary.\nImplement & Perform - Implement designs following Pearson coding standards and industry best practices\nAnalyze & Design - Ensure business and requirements artifacts are created that effectively model the customer's requirements. Use tooling and best practices to create design models from requirements\nReview - Participate in requirements, design and code reviews\nTest & Deployment - Work closely with other teams (e.g., QA, configuration management, end users) to release high quality software. Create testable requirements and write and execute unit tests\nQuality\/process improvement - Participate in group improvement activities and initiatives to improve process and product quality in pursuit of excellence\nRequired Experience\nExperience as a fullstack engineer with Go, Javascript\/Typescript, VueJS, Python, Postgres, MongoDB\nExperience with Cloud AWS hosted applications\nBachelor degree in Computer Science, MIS, or equivalent technology discipline\nSoftware development experience creating SaaS applications\nExperience with development, maintenance, and testing of software following industry best practices\nExperience with highly available, highly concurrent web-based applications\nExperience with GIT or similar VCS tools\nExperience working in an agile environment\nDesirable Experience\nDesire to expand knowledge in many development languages, applications, and tools\nQuickly learn new processes and tools, business domains and technical applications\nAble to think technically and analytically\nAbility to understand the philosophy of architecture\nMust assimilate information, distil knowledge, apply experience and provide solution alternatives and recommendations\nMust have strong time management skills - including the ability to work well under pressure, plan, set priorities, adapt to change, and meet established timelines\nMust be a self-starter and detail-oriented\nEffective written and verbal communication skills\nAbility to work within a team\nExperience with some or all of the following is considered a bonus:\nIMS LTI (Learning Tools Interoperability)\nIMS QTI (Question & Test Interoperability)\nIMS OneRoster\nCommon K-12 reporting frameworks such as (Ed-fi and Caliper)\nThe full-time salary range for this position is between $125,000 - $150,000. This position is eligible to participate in an annual incentive program, and information on benefits offered is here.\nWho We Are\nAt Pearson, our purpose is simple: to help people realize the life they imagine through learning. We believe that every learning opportunity is a chance for a personal breakthrough. We are the world's lifelong learning company. For us, learning isn't just what we do. It's who we are. To learn more: We are Pearson.\nPearson is an Equal Opportunity Employer and a member of E-Verify. Employment decisions are based on qualifications, merit and business need. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status or any other group protected by law. We actively seek qualified candidates who are protected veterans and individuals with disabilities as defined under VEVRAA and Section 503 of the Rehabilitation Act.\nIf you are an individual with a disability and are unable or limited in your ability to use or access our career site as a result of your disability, you may request reasonable accommodations by emailing TalentExperienceGlobalTeam@grp.pearson.com.\nJob:\nTECHNOLOGY\nOrganization:\nAssessment & Qualifications\nSchedule:\nFULL_TIME\nWorkplace Type:\nRemote\nReq ID:\n18587\n#location\nShow more\nShow less","all_details":"- Implement & Perform - Implement designs following Pearson coding standards and industry best practices\n- Analyze & Design - Ensure business and requirements artifacts are created that effectively model the customer's requirements. Use tooling and best practices to create design models from requirements\n- Review - Participate in requirements, design and code reviews\n- Test & Deployment - Work closely with other teams (e.g., QA, configuration management, end users) to release high quality software. Create testable requirements and write and execute unit tests\n- Quality\/process improvement - Participate in group improvement activities and initiatives to improve process and product quality in pursuit of excellence\n- Experience as a fullstack engineer with Go, Javascript\/Typescript, VueJS, Python, Postgres, MongoDB\n- Experience with Cloud AWS hosted applications\n- Bachelor degree in Computer Science, MIS, or equivalent technology discipline\n- Software development experience creating SaaS applications\n- Experience with development, maintenance, and testing of software following industry best practices\n- Experience with highly available, highly concurrent web-based applications\n- Experience with GIT or similar VCS tools\n- Experience working in an agile environment\n- Desire to expand knowledge in many development languages, applications, and tools\n- Quickly learn new processes and tools, business domains and technical applications\n- Able to think technically and analytically\n- Ability to understand the philosophy of architecture\n- Must assimilate information, distil knowledge, apply experience and provide solution alternatives and recommendations\n- Must have strong time management skills - including the ability to work well under pressure, plan, set priorities, adapt to change, and meet established timelines\n- Must be a self-starter and detail-oriented\n- Effective written and verbal communication skills\n- Ability to work within a team\n- IMS LTI (Learning Tools Interoperability)\n- IMS QTI (Question & Test Interoperability)\n- IMS OneRoster\n- Common K-12 reporting frameworks such as (Ed-fi and Caliper)"}
{"job_id":"4205040611","company":"Tesla","title":"Manufacturing Equipment Engineer, Power Electronics","location":"Sparks, NV","date_posted":"1 month ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Management and Manufacturing","industries":"Motor Vehicle Manufacturing, Renewable Energy Semiconductor Manufacturing, and Utilities","company_website":null,"workplace_type":null,"description":"What To Expect\nA Manufacturing Equipment Engineer in the Production Engineering team will be a part of operating, sustaining, and improving some of the most automated manufacturing equipment in the world. The best candidate for the position has a high aptitude to learn new skillsets in the position. The expectation is that engineers will start with strengths in a given field (AUTOCAD, robotics, PLC Programming, vision, Python, HMI scripting, etc) and then learn all other areas from those who work with them. This role requires capability across the board to sustain all parts of the automated equipment.\nWhat You'll Do\nSustain 24 by 7 production operations through responding to and resolving breakdowns quickly and efficiently to minimize downtime\nActive leader of a cross functional TPM team while taking on improvement projects to assist in improving the factory. Diagnoses equipment failures, finds root cause and improve Overall Equipment Effectiveness. Lead equipment upgrades with a focus on serviceability, reliability, and process capability\nDevelop and improve equipment validation procedures including calibration and qualification\nBecome Expert Level Trainer on all machines in assigned area and be responsible for the level of knowledge of Shift technicians. Provide hands-on support to maintenance team to troubleshoot and resolve extended downtime situations\nTakes initiative to create, implement and improve Preventative and Predictive Maintenance documents and schedules, under the direction of the Maintenance Planner\nProgram ladder logic and structured text on multiple PLC controller platforms (Siemens preferred)\nProgram and teach industrial 6-axis robots (Fanuc, Philips) Sequence complex, multi-station machinery for material pick-and-place, dispense, fastening, welding and conveyance applications\nParticipate in spare part analysis and inventory development, cost reduction, improvement working with Spares Department to RMA faulty components and communicate needs to the vendor\nWhat You'll Bring\nDegree in Mechanical, Electrical, Mechatronics, or equivalent experience\nExperience with PLC programming, troubleshooting and configuration. Good overall computer skills with demonstrated ability in Siemens programming language is preferred\nExperience with 2D, 3D vision systems\nExperience commissioning and improving Equipment. Have a demonstrated track record of Overall Equipment Effectiveness (OEE) improvement, Preventative and Predictive Maintenance activities, preferred\nRobotics maintenance, troubleshooting, optimization & teaching experience\n4+ years in a highly automated, high volume manufacturing facility, good understanding of Computerized Maintenance Management System (CMMS), Safety, Ergonomics, Change Point Management, Spare Parts Management, is a plus\nStrong problem-solving skills and an aptitude for learning systems quickly. Able to utilize structured problem-solving techniques such as DMAIC, Ishikawa, Five Why (5W) or Eight Disciplines (8D). Able to resolve high level performance issues into addressable actions, preferred\nAble to read and interpret basic mechanical drawings and electrical schematics, experience developing and improving HMI’s, Fanuc Robotics \/ Ignition Experience, preferred\nStrong ability to work and communicate effectively with team and peers within a manufacturing and engineering organization as well as cross functional teams. This includes excellent communication skills: written and verbal\nPassion for making fantastic new products and using testing to enable an engineering organization to achieve outstanding quality, reliability, and excellence. Willing to perform shift work (nights and weekends) and overtime as required\nBenefits\nCompensation and Benefits\nAlong with competitive pay, as a full-time Tesla employee, you are eligible for the following benefits at day 1 of hire:\nAetna PPO and HSA plans > 2 medical plan options with $0 payroll deduction\nFamily-building, fertility, adoption and surrogacy benefits\nDental (including orthodontic coverage) and vision plans, both have options with a $0 paycheck contribution\nCompany Paid (Health Savings Account) HSA Contribution when enrolled in the High Deductible Aetna medical plan with HSA\nHealthcare and Dependent Care Flexible Spending Accounts (FSA)\n401(k) with employer match, Employee Stock Purchase Plans, and other financial benefits\nCompany paid Basic Life, AD&D, short-term and long-term disability insurance\nEmployee Assistance Program\nSick and Vacation time (Flex time for salary positions), and Paid Holidays\nBack-up childcare and parenting support resources\nVoluntary benefits to include: critical illness, hospital indemnity, accident insurance, theft & legal services, and pet insurance\nWeight Loss and Tobacco Cessation Programs\nTesla Babies program\nCommuter benefits\nEmployee discounts and perks program\n, Tesla\nShow more\nShow less","all_details":"- Sustain 24 by 7 production operations through responding to and resolving breakdowns quickly and efficiently to minimize downtime\n- Active leader of a cross functional TPM team while taking on improvement projects to assist in improving the factory. Diagnoses equipment failures, finds root cause and improve Overall Equipment Effectiveness. Lead equipment upgrades with a focus on serviceability, reliability, and process capability\n- Develop and improve equipment validation procedures including calibration and qualification\n- Become Expert Level Trainer on all machines in assigned area and be responsible for the level of knowledge of Shift technicians. Provide hands-on support to maintenance team to troubleshoot and resolve extended downtime situations\n- Takes initiative to create, implement and improve Preventative and Predictive Maintenance documents and schedules, under the direction of the Maintenance Planner\n- Program ladder logic and structured text on multiple PLC controller platforms (Siemens preferred)\n- Program and teach industrial 6-axis robots (Fanuc, Philips) Sequence complex, multi-station machinery for material pick-and-place, dispense, fastening, welding and conveyance applications\n- Participate in spare part analysis and inventory development, cost reduction, improvement working with Spares Department to RMA faulty components and communicate needs to the vendor\n- Degree in Mechanical, Electrical, Mechatronics, or equivalent experience\n- Experience with PLC programming, troubleshooting and configuration. Good overall computer skills with demonstrated ability in Siemens programming language is preferred\n- Experience with 2D, 3D vision systems\n- Experience commissioning and improving Equipment. Have a demonstrated track record of Overall Equipment Effectiveness (OEE) improvement, Preventative and Predictive Maintenance activities, preferred\n- Robotics maintenance, troubleshooting, optimization & teaching experience\n- 4+ years in a highly automated, high volume manufacturing facility, good understanding of Computerized Maintenance Management System (CMMS), Safety, Ergonomics, Change Point Management, Spare Parts Management, is a plus\n- Strong problem-solving skills and an aptitude for learning systems quickly. Able to utilize structured problem-solving techniques such as DMAIC, Ishikawa, Five Why (5W) or Eight Disciplines (8D). Able to resolve high level performance issues into addressable actions, preferred\n- Able to read and interpret basic mechanical drawings and electrical schematics, experience developing and improving HMI’s, Fanuc Robotics \/ Ignition Experience, preferred\n- Strong ability to work and communicate effectively with team and peers within a manufacturing and engineering organization as well as cross functional teams. This includes excellent communication skills: written and verbal\n- Passion for making fantastic new products and using testing to enable an engineering organization to achieve outstanding quality, reliability, and excellence. Willing to perform shift work (nights and weekends) and overtime as required\n- Aetna PPO and HSA plans > 2 medical plan options with $0 payroll deduction\n- Family-building, fertility, adoption and surrogacy benefits\n- Dental (including orthodontic coverage) and vision plans, both have options with a $0 paycheck contribution\n- Company Paid (Health Savings Account) HSA Contribution when enrolled in the High Deductible Aetna medical plan with HSA\n- Healthcare and Dependent Care Flexible Spending Accounts (FSA)\n- 401(k) with employer match, Employee Stock Purchase Plans, and other financial benefits\n- Company paid Basic Life, AD&D, short-term and long-term disability insurance\n- Employee Assistance Program\n- Sick and Vacation time (Flex time for salary positions), and Paid Holidays\n- Back-up childcare and parenting support resources\n- Voluntary benefits to include: critical illness, hospital indemnity, accident insurance, theft & legal services, and pet insurance\n- Weight Loss and Tobacco Cessation Programs\n- Tesla Babies program\n- Commuter benefits\n- Employee discounts and perks program"}
{"job_id":"4216066306","company":"Jobot","title":"Senior Protocol Engineer (Remote)","location":"Reno, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"IT Services and IT Consulting and Software Development","company_website":null,"workplace_type":null,"description":"Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!\nJob details\nWell funded crypto infrastructure startup is looking for a Senior Protocol Engineer to join their growing team!\nThis Jobot Job is hosted by Sydney Weaver\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\nSalary $150,000 - $500,000 per year\nA Bit About Us\nVenture-backed crypto startup is looking for a highly skilled Senior Protocol Engineer to join their growing team! In this role, you will play a key role in designing, implementing, and optimizing their core systems and infrastructure using the Rust programming language. Join their dynamic and innovative team, and be part of shaping the future of crypto infrastructure.\nResponsibilities\nDesign, build, and maintain our blockchain infrastructure using Rust\nBuilding our novel trust-minimized (honest minority) settlement layer for Solana VM rollups\nNovel customizations by the request of dApps deploying to our platform and support additional bytecode for rollups and build\nCollaborate with our team of developers and other teams to integrate our blockchain platform with other systems and ensure the smooth operation of our blockchain platform\nDevelop and implement security protocols to protect our blockchain infrastructure and monitor + troubleshoot any issues that arise\nStay up-to-date with the latest developments in blockchain technology and make recommendations for new features and improvements\nWhy join us?\nThey offer competitive compensation, benefits, and a stimulating work environment where your expertise will be highly valued and your ideas can make a significant impact!\nGreat health benefits package, PTO \/ Vacation, 401K + match\nRemote work (local to USA)\nGreat culture, innovative team, and growth opportunity\nHighly competitive comp package with a base salary + cash bonus + token or equity.\nOpportunity to make a high impact on both the company’s product and as well as the industry at large.\nJob Details\nTheir product will enable users to deploy their apps as their own customizable rollups, where they can pick (1) the base layer, (2) the virtual machine (EVM, SVM, Move), and (3) additional modifications for greater value accrual. As a R&D Engineer, you will be responsible for designing, building, and maintaining our blockchain infrastructure. You will work closely with our team of developers to ensure the smooth operation of our blockchain platform. This is a permanent position in a dynamic and exciting startup environment.\nQualifications\n1 + years of experience working at a crypto native startup, preferably blockchain infrastructure\n1.5+ years of experience minimum working with Rust programming language\nExperience working on Solana\nDeep understanding of blockchain technology and protocols\nExperience with blockchain security protocols and best practices\nBonus Familiarity with optimistic & zero-knowledge tech\nKnowledge of distributed systems and networking\nAbility to work independently and as part of a team\nExcellent problem-solving and analytical skills\nStrong communication and collaboration skills\nIf you are passionate about blockchain technology and have a proven track record of building and maintaining blockchain infrastructure, we want to hear from you. This is an exciting opportunity to join a fast-growing startup and make a significant impact on the future of blockchain technology.\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\nJobot is an Equal Opportunity Employer. We provide an inclusive work environment that celebrates diversity and all qualified candidates receive consideration for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nSometimes Jobot is required to perform background checks with your authorization. Jobot will consider qualified candidates with criminal histories in a manner consistent with any applicable federal, state, or local law regarding criminal backgrounds, including but not limited to the Los Angeles Fair Chance Initiative for Hiring and the San Francisco Fair Chance Ordinance.\nWant to learn more about this role and Jobot?\nClick our Jobot logo and follow our LinkedIn page!\nShow more\nShow less","all_details":"- Design, build, and maintain our blockchain infrastructure using Rust\n- Building our novel trust-minimized (honest minority) settlement layer for Solana VM rollups\n- Novel customizations by the request of dApps deploying to our platform and support additional bytecode for rollups and build\n- Collaborate with our team of developers and other teams to integrate our blockchain platform with other systems and ensure the smooth operation of our blockchain platform\n- Develop and implement security protocols to protect our blockchain infrastructure and monitor + troubleshoot any issues that arise\n- Stay up-to-date with the latest developments in blockchain technology and make recommendations for new features and improvements\n- Great health benefits package, PTO \/ Vacation, 401K + match\n- Remote work (local to USA)\n- Great culture, innovative team, and growth opportunity\n- Highly competitive comp package with a base salary + cash bonus + token or equity.\n- Opportunity to make a high impact on both the company’s product and as well as the industry at large.\n- 1 + years of experience working at a crypto native startup, preferably blockchain infrastructure\n- 1.5+ years of experience minimum working with Rust programming language\n- Experience working on Solana\n- Deep understanding of blockchain technology and protocols\n- Experience with blockchain security protocols and best practices\n- Bonus Familiarity with optimistic & zero-knowledge tech\n- Knowledge of distributed systems and networking\n- Ability to work independently and as part of a team\n- Excellent problem-solving and analytical skills\n- Strong communication and collaboration skills"}
{"job_id":"4217679047","company":"Affirm","title":"Staff Software Engineer, Backend (Virtual Cards Platform)","location":"Las Vegas, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services","company_website":null,"workplace_type":null,"description":"Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\nThe Virtual Cards (VCN) Platform Engineering team powers all of Affirm's products that depend on one-time-use cards. Virtual cards enable consumers to leverage Affirm’s financial products at effectively any merchant that accepts card payments, supporting online ecommerce, physical instore, and digital wallet integrations such as Apple Pay and Google Pay. By providing the systems that bridge Affirm and external credit networks like Visa, the VCN Platform team is critical in enabling increased scale of Affirm’s network.\nWhat You'll Do\nYou will be responsible for setting technical strategy for your team on a year-long time scale, and help your team tie it together with critical, business-impacting projects.\nYou will collaborate across teams in the product development lifecycle by collaborating with product management, design & analytics to ensure technical sustainability, risks and trade-offs are well understood and managed.\nYou will act as a force-multiplier for your team through your definition and advocacy of technical solutions and operational processes.\nYou take ownership of your team’s operations and availability by ensuring you have the right monitoring, triage rotations, playbooks, polcities, testing and alerting in place to support “keep the lights on” & on-call efforts.\nYou will foster a culture of quality and ownership on your team by setting code review and design standards for your team, and advocating for them beyond your team through your writing and tech talks.\nYou will help develop talent on your team by providing feedback and guidance, and leading by example.\nWhat We Look For\nYou have 7+ years of experience designing, developing and launching backend systems at scale using languages like Python or Kotlin.\nYou have an extensive track record of developing highly available distributed systems using technologies like AWS, MySQL, Spark and Kubernetes.\nYou have experience delivering major features, system components or deprecating existing functionality in a system through the definition of a technical and execution plan. You write high quality code that is easily understood and used by others.\nYou thrive in ambiguity, and are comfortable moving from low level language idioms all the way to the architecture of large systems to understand how they work.\nYour growth and impact trajectory demonstrates that you have mastered gathering and iterating on feedback from your engineering and cross-functional peers.\nYou have strong verbal and written communication skills that support effective collaboration with our global engineering team.\nYou have experience in the card network landscape, building and launching card products or adjacent payments related technologies.\nThis position requires either equivalent practical experience or a Bachelor’s degree in a related field.\nBase Pay Grade\n- P\nEquity Grade\n- 13\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $225,000 - $275,000\nUSA base pay range (all other U.S. states) per year: $200,000 - $250,000\nLocation: Remote - US\nAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.\nBenefits\nWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:\nHealth care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\nFlexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\nTime off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\nESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount\nWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.\n[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.\nBy clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.\nShow more\nShow less","all_details":"- You will be responsible for setting technical strategy for your team on a year-long time scale, and help your team tie it together with critical, business-impacting projects.\n- You will collaborate across teams in the product development lifecycle by collaborating with product management, design & analytics to ensure technical sustainability, risks and trade-offs are well understood and managed.\n- You will act as a force-multiplier for your team through your definition and advocacy of technical solutions and operational processes.\n- You take ownership of your team’s operations and availability by ensuring you have the right monitoring, triage rotations, playbooks, polcities, testing and alerting in place to support “keep the lights on” & on-call efforts.\n- You will foster a culture of quality and ownership on your team by setting code review and design standards for your team, and advocating for them beyond your team through your writing and tech talks.\n- You will help develop talent on your team by providing feedback and guidance, and leading by example.\n- You have 7+ years of experience designing, developing and launching backend systems at scale using languages like Python or Kotlin.\n- You have an extensive track record of developing highly available distributed systems using technologies like AWS, MySQL, Spark and Kubernetes.\n- You have experience delivering major features, system components or deprecating existing functionality in a system through the definition of a technical and execution plan. You write high quality code that is easily understood and used by others.\n- You thrive in ambiguity, and are comfortable moving from low level language idioms all the way to the architecture of large systems to understand how they work.\n- Your growth and impact trajectory demonstrates that you have mastered gathering and iterating on feedback from your engineering and cross-functional peers.\n- You have strong verbal and written communication skills that support effective collaboration with our global engineering team.\n- You have experience in the card network landscape, building and launching card products or adjacent payments related technologies.\n- This position requires either equivalent practical experience or a Bachelor’s degree in a related field.\n- Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\n- Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\n- Time off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\n- ESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount"}
{"job_id":"4216065275","company":"Jobot","title":"Senior Protocol Engineer (Remote)","location":"Las Vegas, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"IT Services and IT Consulting and Software Development","company_website":null,"workplace_type":null,"description":"Want to learn more about this role and Jobot? Click our Jobot logo and follow our LinkedIn page!\nJob details\nWell funded crypto infrastructure startup is looking for a Senior Protocol Engineer to join their growing team!\nThis Jobot Job is hosted by Sydney Weaver\nAre you a fit? Easy Apply now by clicking the \"Easy Apply\" button and sending us your resume.\nSalary $150,000 - $500,000 per year\nA Bit About Us\nVenture-backed crypto startup is looking for a highly skilled Senior Protocol Engineer to join their growing team! In this role, you will play a key role in designing, implementing, and optimizing their core systems and infrastructure using the Rust programming language. Join their dynamic and innovative team, and be part of shaping the future of crypto infrastructure.\nResponsibilities\nDesign, build, and maintain our blockchain infrastructure using Rust\nBuilding our novel trust-minimized (honest minority) settlement layer for Solana VM rollups\nNovel customizations by the request of dApps deploying to our platform and support additional bytecode for rollups and build\nCollaborate with our team of developers and other teams to integrate our blockchain platform with other systems and ensure the smooth operation of our blockchain platform\nDevelop and implement security protocols to protect our blockchain infrastructure and monitor + troubleshoot any issues that arise\nStay up-to-date with the latest developments in blockchain technology and make recommendations for new features and improvements\nWhy join us?\nThey offer competitive compensation, benefits, and a stimulating work environment where your expertise will be highly valued and your ideas can make a significant impact!\nGreat health benefits package, PTO \/ Vacation, 401K + match\nRemote work (local to USA)\nGreat culture, innovative team, and growth opportunity\nHighly competitive comp package with a base salary + cash bonus + token or equity.\nOpportunity to make a high impact on both the company’s product and as well as the industry at large.\nJob Details\nTheir product will enable users to deploy their apps as their own customizable rollups, where they can pick (1) the base layer, (2) the virtual machine (EVM, SVM, Move), and (3) additional modifications for greater value accrual. As a R&D Engineer, you will be responsible for designing, building, and maintaining our blockchain infrastructure. You will work closely with our team of developers to ensure the smooth operation of our blockchain platform. This is a permanent position in a dynamic and exciting startup environment.\nQualifications\n1 + years of experience working at a crypto native startup, preferably blockchain infrastructure\n1.5+ years of experience minimum working with Rust programming language\nExperience working on Solana\nDeep understanding of blockchain technology and protocols\nExperience with blockchain security protocols and best practices\nBonus Familiarity with optimistic & zero-knowledge tech\nKnowledge of distributed systems and networking\nAbility to work independently and as part of a team\nExcellent problem-solving and analytical skills\nStrong communication and collaboration skills\nIf you are passionate about blockchain technology and have a proven track record of building and maintaining blockchain infrastructure, we want to hear from you. This is an exciting opportunity to join a fast-growing startup and make a significant impact on the future of blockchain technology.\nInterested in hearing more? Easy Apply now by clicking the \"Easy Apply\" button.\nJobot is an Equal Opportunity Employer. We provide an inclusive work environment that celebrates diversity and all qualified candidates receive consideration for employment without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\nSometimes Jobot is required to perform background checks with your authorization. Jobot will consider qualified candidates with criminal histories in a manner consistent with any applicable federal, state, or local law regarding criminal backgrounds, including but not limited to the Los Angeles Fair Chance Initiative for Hiring and the San Francisco Fair Chance Ordinance.\nWant to learn more about this role and Jobot?\nClick our Jobot logo and follow our LinkedIn page!\nShow more\nShow less","all_details":"- Design, build, and maintain our blockchain infrastructure using Rust\n- Building our novel trust-minimized (honest minority) settlement layer for Solana VM rollups\n- Novel customizations by the request of dApps deploying to our platform and support additional bytecode for rollups and build\n- Collaborate with our team of developers and other teams to integrate our blockchain platform with other systems and ensure the smooth operation of our blockchain platform\n- Develop and implement security protocols to protect our blockchain infrastructure and monitor + troubleshoot any issues that arise\n- Stay up-to-date with the latest developments in blockchain technology and make recommendations for new features and improvements\n- Great health benefits package, PTO \/ Vacation, 401K + match\n- Remote work (local to USA)\n- Great culture, innovative team, and growth opportunity\n- Highly competitive comp package with a base salary + cash bonus + token or equity.\n- Opportunity to make a high impact on both the company’s product and as well as the industry at large.\n- 1 + years of experience working at a crypto native startup, preferably blockchain infrastructure\n- 1.5+ years of experience minimum working with Rust programming language\n- Experience working on Solana\n- Deep understanding of blockchain technology and protocols\n- Experience with blockchain security protocols and best practices\n- Bonus Familiarity with optimistic & zero-knowledge tech\n- Knowledge of distributed systems and networking\n- Ability to work independently and as part of a team\n- Excellent problem-solving and analytical skills\n- Strong communication and collaboration skills"}
{"job_id":"4219017909","company":"Canonical","title":"Associate Linux Support Engineer","location":"Las Vegas, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder led, profitable and growing.\nWe are hiring an\nAssociate Support Engineer\nto build a career with Canonical and support the technical needs of customers leveraging Ubuntu and open source products. This role is an opportunity for a hands-on engineer with eagerness to learn, a passion for Linux and open source technologies to work with some of the best people in the industry at Canonical.\nWe regularly solve interesting, technical problems. From triaging complex cloud environments, desktop and server issues, Linux kernel crashes we've never seen before to OS configuration issues and root cause analysis, we provide an expert level of support and satisfaction to our peer groups and customers. You will be accountable for delivering an outstanding technical support experience on the full technical stack at Canonical, across cloud, desktop and IoT. From problem qualification to full resolution, you will own and manage your cases. When needed, you will transfer your cases to your colleagues or involve senior engineers. This is a globally remote role.\nLocation:\nThis is a globally remote role.\nThe role entails\nWorking from your remote home office to provide technical support for employees.\nBeing available to take ownership of new cases via telephone, email and web\nActing as an internal customer advocate keeping them updated in a timely manner\nEnsuring that each support case owned by you is handled according to our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments.\nContributing new knowledge base articles and maintaining existing articles, ensuring shared knowledge and lessons learned are available to customers.\nDrafting and distributing technical notices for internal and external communication.\nPrioritising your work in order to accomplish the most important and urgent tasks first\nKeeping on learning as our products and services grow and evolve\nUnderstanding Ubuntu development process to be able to set customer expectations correctly on timeline for a fix\nMaintaining regular communication and information exchange with the rest of the team, locally and remotely\nIdentifying and suggesting any opportunities to provide a better service\nParticipating in a regular weekend working rotation\nWhat we are looking for in you\nExceptional academic track record from both high school and university\nUndergraduate degree in a technical subject or a compelling narrative about your alternative chosen path. Preferable majors: Computer Science, MIS, Electrical Engineering, etc.\nConfidence to respectfully speak up, exchange feedback, and share ideas without hesitation\nTrack record of going above-and-beyond expectations to achieve outstanding results\nExperience with Linux troubleshooting (collecting logs and stack traces, fine-tuning by editing configuration files)\nKnowledge or basic hands-on experience on 2 or more of:\nLinux server administration\nProgramming fundamentals in any language (bash, Perl, Ruby, Javascript, C or C++, Go)\nNetworking (bonding, firewalling, bridging, switching, network file system tuning, MTU issues, etc.)\nVirtualization \/ Cloud computing concepts (provisioning, monitoring, orchestration, etc.)\nAbility to learn quickly, thrive on change and handle the pressure of a customer facing job\nStrong written and verbal English communication skills\nAppreciative of diversity, polite and effective in a multi-cultural, multi-national organisation\nResult-oriented, with a personal drive to meet commitments\nAbility to travel internationally twice a year, for company events up to two weeks long\nNoting that we require and will perform a background check for this role.\nNice-to-have skills\nExperience supporting virtualized environments (KVM, Virtual Box, VMWare)\nExperience with other open-source desktop technologies\nActive contribution to open-source projects\/forum\/code\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Working from your remote home office to provide technical support for employees.\n- Being available to take ownership of new cases via telephone, email and web\n- Acting as an internal customer advocate keeping them updated in a timely manner\n- Ensuring that each support case owned by you is handled according to our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments.\n- Contributing new knowledge base articles and maintaining existing articles, ensuring shared knowledge and lessons learned are available to customers.\n- Drafting and distributing technical notices for internal and external communication.\n- Prioritising your work in order to accomplish the most important and urgent tasks first\n- Keeping on learning as our products and services grow and evolve\n- Understanding Ubuntu development process to be able to set customer expectations correctly on timeline for a fix\n- Maintaining regular communication and information exchange with the rest of the team, locally and remotely\n- Identifying and suggesting any opportunities to provide a better service\n- Participating in a regular weekend working rotation\n- Exceptional academic track record from both high school and university\n- Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path. Preferable majors: Computer Science, MIS, Electrical Engineering, etc.\n- Confidence to respectfully speak up, exchange feedback, and share ideas without hesitation\n- Track record of going above-and-beyond expectations to achieve outstanding results\n- Experience with Linux troubleshooting (collecting logs and stack traces, fine-tuning by editing configuration files)\n- Knowledge or basic hands-on experience on 2 or more of:\n- Linux server administration\n- Programming fundamentals in any language (bash, Perl, Ruby, Javascript, C or C++, Go)\n- Networking (bonding, firewalling, bridging, switching, network file system tuning, MTU issues, etc.)\n- Virtualization \/ Cloud computing concepts (provisioning, monitoring, orchestration, etc.)\n- Ability to learn quickly, thrive on change and handle the pressure of a customer facing job\n- Strong written and verbal English communication skills\n- Appreciative of diversity, polite and effective in a multi-cultural, multi-national organisation\n- Result-oriented, with a personal drive to meet commitments\n- Ability to travel internationally twice a year, for company events up to two weeks long\n- Experience supporting virtualized environments (KVM, Virtual Box, VMWare)\n- Experience with other open-source desktop technologies\n- Active contribution to open-source projects\/forum\/code\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass, and travel upgrades for long haul company events"}
{"job_id":"4228415575","company":"Canonical","title":"Cloud Support Engineer","location":"Las Vegas, NV","date_posted":"1 day ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder led, profitable and growing.\nWe are hiring a Cloud Support Engineer to build a career with Canonical and support the technical needs of customers leveraging Ubuntu and open source products. If you have an affinity for open source development and a passion for technology, then you will enjoy working with some of the best people in the industry at Canonical.\nWe regularly solve interesting, technical problems. From triaging complex Cloud environment issues, Linux kernel crashes we've never seen before to OS configuration issues and root cause analysis, we provide an expert level of support and satisfaction to our peer groups and customers. We are rapidly expanding and are looking for talented problem solvers with a passion for working on the next generation of Ubuntu solutions for our customers.\nLocation:\nThis is a globally remote role, unless specified otherwise.\nThe role entails\nInvestigate issues reported by customers by researching and escalating issues\nWork to resolve complex customer problems related to Canonical's portfolio of products.\nOwnership of results: Ensure that each support case owned by you is handled according to our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments.\nEngage directly with customers and work collaboratively by phone, ticketing system, and remote sessions to resolve their issues.\nParticipate in a regular weekend working rotation.\nContribute new knowledge base articles and maintain existing articles, ensuring shared knowledge and lessons learned are available to customers.\nUnderstanding Ubuntu development process to be able to set customer expectations correctly on timeline for a fix.\nWhat are we looking for in you\nProfessional written and spoken English with excellent presentation skills\nExceptional academic track record from both high school and university\nUndergraduate degree in a technical subject or a compelling narrative about your alternative chosen path\nTrack record of going above-and-beyond expectations to achieve outstanding results\nHands-on and extensive working experience in supporting Linux systems including 3 or more of:\nVirtualization \/ Cloud - primarily using KVM or OpenStack.\nContainers - especially with Docker, LXD\/LXC, or Kubernetes.\nStorage technologies - block, object and network.\nNetworking (bonding, firewalling, bridging, switching, network file system tuning, MTU issues, etc.).\nCloud computing expertise in provisioning, monitoring, orchestration, etc.\nAdvanced troubleshooting experience:\nLinux integration with other environments (authentication\/directory services, network file systems, etc.).\nAbility to navigate effectively stack traces and logs, and advise on next steps.\nSolid understanding of OS and Application level bugs and when to escalate to the correct team.\nProgramming fundamentals in any language.\nExtensive Customer support experience is key:\nCustomer needs are top priority.\nCommunicate professionally, emphatically, clearly and set the right expectations.\nAbility to travel internationally twice a year for company events up to two weeks long.\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Investigate issues reported by customers by researching and escalating issues\n- Work to resolve complex customer problems related to Canonical's portfolio of products.\n- Ownership of results: Ensure that each support case owned by you is handled according to our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments.\n- Engage directly with customers and work collaboratively by phone, ticketing system, and remote sessions to resolve their issues.\n- Participate in a regular weekend working rotation.\n- Contribute new knowledge base articles and maintain existing articles, ensuring shared knowledge and lessons learned are available to customers.\n- Understanding Ubuntu development process to be able to set customer expectations correctly on timeline for a fix.\n- Professional written and spoken English with excellent presentation skills\n- Exceptional academic track record from both high school and university\n- Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path\n- Track record of going above-and-beyond expectations to achieve outstanding results\n- Hands-on and extensive working experience in supporting Linux systems including 3 or more of:\n- Virtualization \/ Cloud - primarily using KVM or OpenStack.\n- Containers - especially with Docker, LXD\/LXC, or Kubernetes.\n- Storage technologies - block, object and network.\n- Networking (bonding, firewalling, bridging, switching, network file system tuning, MTU issues, etc.).\n- Cloud computing expertise in provisioning, monitoring, orchestration, etc.\n- Advanced troubleshooting experience:\n- Linux integration with other environments (authentication\/directory services, network file systems, etc.).\n- Ability to navigate effectively stack traces and logs, and advise on next steps.\n- Solid understanding of OS and Application level bugs and when to escalate to the correct team.\n- Programming fundamentals in any language.\n- Extensive Customer support experience is key:\n- Customer needs are top priority.\n- Communicate professionally, emphatically, clearly and set the right expectations.\n- Ability to travel internationally twice a year for company events up to two weeks long.\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass, and travel upgrades for long haul company events"}
{"job_id":"4212773836","company":"Canonical","title":"Software Engineer - packaging - optimize Ubuntu Server","location":"Las Vegas, NV","date_posted":"3 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder led, profitable and growing.\nCanonical's Ubuntu Engineering Server Team is looking for open source enthusiasts to help build the distro of the future. The Server Team maintains and packages a wide variety of software including webservers, databases, and virtualization and containerization stacks. This is an exciting opportunity for you, a software engineer passionate about open source software. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, a growing international software company and help us to bring free software to the widest audience.\nUbuntu Server is a platform that enables amazing technology the whole world over, and is the #1 operating system in the public clouds. Applicants to this role will have the opportunity to help with everything that goes into evolving Ubuntu. You will get to work with our experienced team and have the benefits of learning and growing alongside the best engineers in the business.\nThis role entails\nCollaborating proactively within a distributed team\nFostering a software ecosystem with seamless user experience for all Ubuntu users\nEvaluating contributions of other engineers to maintain high-quality software standards.\nPlaying a role in shaping the future of Ubuntu via both - new ideas in your areas of interest and advising on work being done elsewhere\nCollaborating with other teams in the Ubuntu and Debian communities, with upstream projects, and commercially supported customers\nDebugging issues on open source code and team maintained code.\nWorking with the team to maintain Ubuntu Server packages, specifically but not limited to:\nTraditional server workloads (web servers, databases, network services, etc)\nVirtualisation and Containers\nPackage management and dependencies\nLanguage runtimes and toolchains\nWork from home with global travel 2 to 4 weeks for internal and external events\nWhat we are looking for in you\nYou love technology and working with brilliant people\nYou are curious, flexible, articulate, and accountable\nYou value soft skills and are passionate, enterprising, thoughtful, and self-motivated\nInterest or experience in open source maintenance or contribution\nYou have a Bachelor's or equivalent in Computer Science, STEM or similar degree (or any higher)\nUnderstands basic reproducibility and testing steps. Comfortable setting up test systems in containers or virtual machines. Able to describe issues and steps clearly\nStrong fundamentals in one language from C\/C++, Python, Rust, Go\nInterest in learning distro packaging\nFundamental understanding of package management and dependency resolution.\nInterest in containerization and virtualization such as Docker or OCI service containers, LXD system containers, and local virtualization like Virtualbox or QEMU, or Public Clouds\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Collaborating proactively within a distributed team\n- Fostering a software ecosystem with seamless user experience for all Ubuntu users\n- Evaluating contributions of other engineers to maintain high-quality software standards.\n- Playing a role in shaping the future of Ubuntu via both - new ideas in your areas of interest and advising on work being done elsewhere\n- Collaborating with other teams in the Ubuntu and Debian communities, with upstream projects, and commercially supported customers\n- Debugging issues on open source code and team maintained code.\n- Working with the team to maintain Ubuntu Server packages, specifically but not limited to:\n- Traditional server workloads (web servers, databases, network services, etc)\n- Virtualisation and Containers\n- Package management and dependencies\n- Language runtimes and toolchains\n- Work from home with global travel 2 to 4 weeks for internal and external events\n- You love technology and working with brilliant people\n- You are curious, flexible, articulate, and accountable\n- You value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n- Interest or experience in open source maintenance or contribution\n- You have a Bachelor's or equivalent in Computer Science, STEM or similar degree (or any higher)\n- Understands basic reproducibility and testing steps. Comfortable setting up test systems in containers or virtual machines. Able to describe issues and steps clearly\n- Strong fundamentals in one language from C\/C++, Python, Rust, Go\n- Interest in learning distro packaging\n- Fundamental understanding of package management and dependency resolution.\n- Interest in containerization and virtualization such as Docker or OCI service containers, LXD system containers, and local virtualization like Virtualbox or QEMU, or Public Clouds\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass, and travel upgrades for long haul company events"}
{"job_id":"4201896184","company":"Panasonic Energy Corporation of North America","title":"Sr. SCADA Engineer","location":"Sparks, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Not Applicable","employment_type":"Full-time","job_function":"Information Technology","industries":"Services for Renewable Energy","company_website":null,"workplace_type":null,"description":"Overview\nDo you want to join a team that's changing the world? Do you have a strong background as a Sr. SCADA Engineer? Then we're looking for you! Check out the job description and apply now! Put your skills to meaningful use, gain unique experience, and work with world-class team members with diverse backgrounds and expertise who share the same vision. Join the PECNA team today!\nResponsibilities\nMeet Panasonic\nMeet the Recruiter: Tanya Aharonov\nExplore Panasonic Careers\nPanasonic Video Our Mission: Create Technologies That Move Us\nJob Title\nSr. SCADA Engineer\nJob Summary\nThe Sr. SCADA Engineer is responsible for leading the development, implementation, and management of the SCADA system at Panasonic’s Gigafactory. Additionally, the Sr. SCADA Engineer manages the documenting system infrastructure and methods to ensure workflows are established and managed. Furthermore, the Sr. SCADA Engineer will lead with helping to improve the SCADA system to ensure business performance is reached at its highest level.\nEssential Duties\nLeads the developing, implementing, and managing Panasonic’s SCADA system within the Gigafactory\nAnalyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods\nTakes on technical leader role in development projects, and helps Engineer levels I, II, and II complete tasks for development\nDetermining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors\nProviding technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning\nConferring with research personnel to clarify or resolve problems and develops design\nDirecting and coordinating manufacturing or building of prototype products or systems\nPlanning and developing experimental test programs\nAnalyzing test data and reports to determine if design meets functional and performance specifications\nEvaluating engineering test results for possible application to developments of systems or other uses\nOther duties may be assigned\nPersonal Protective Equipment (PPE) Requirements\nTo ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PECNA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\nThe foregoing description is not intended and should not be construed to be an exhaustive list of all responsibilities, skills and efforts or work conditions associated with the job. It is intended to be an accurate reflection of the general nature and level of the job.\nQualifications\nQualifications: Requirements - Required and\/or Preferred\nEducation\nBasic\/Required: Bachelor’s Degree in Electrical Engineering, Mechanical Engineering, or related field\nPreferred: None\nEssential Qualifications\nMinimum of 8+ years of experience with SCADA systems and OPC communication\nThorough understanding of feedback control systems and PID controllers\nStrong understanding of ladder logic\nAdvanced knowledge of best manufacturing and programming practices such as ISA standards and compliance\nAdvanced knowledge of Modbus, Ethercat, Ethernet IP, Profinet, MQTT, OPC UA and SQL\nExperience designing high availability systems and databases in a manufacturing environment\nBackground working in a high-volume manufacturing environment\nUnderstanding of electrical hardware, drawings, sequence control and software design\nAbility to cooperate and work with related departments including overseas\nFlexibility to solve issues with first principles thinking\nStrong computer skills with Microsoft Office Suite, including Word, Excel and PowerPoint\nMust have working-level knowledge of the English language, including reading, writing, and speaking English\nPreferred Qualifications\nExperience programming, installing, and troubleshooting manufacturing image vision systems such as Keyence and Cognex\nExperience programming, installing, and troubleshooting PLC systems, preferably Mitsubishi or Omron\nKnowledge of ISA88 physical model systems such as PackML\nKnowledge and handling about American environmental laws and UL (Underwriters Laboratories)\nAlignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)\nAbout Us\nPanasonic Energy (PECNA) is collaborating with Tesla at a massive battery factory near Reno, Nevada which is known for its quality of life and expansive outdoor adventures. Panasonic's role at the Gigafactory is to manufacture and supply cylindrical lithium-ion cells to Tesla for their electric vehicles and energy storage systems.\nOver the past few years, the Gigafactory has grown to the largest lithium-ion battery factory in the world. Together with our partner Tesla, we continue to revolutionize the lithium-ion battery space and accelerate the world’s transition to sustainable energy and transportation.\nOur mission at PECNA is to make the vision of affordable Electric Vehicles a reality by producing the world’s safest, high quality, and lowest cost batteries. Through this effort we will create a clean energy society and our products will change society’s use of and perceptions of electric power.\nIn addition to an environment that is as innovative as our products, we offer competitive salaries and benefits.\nSupplemental Information\nPre-employment drug testing is required. Due to the high volume of responses, we will only be able to respond to candidates of interest. All candidates must have valid authorization to work in the U.S. without restriction.\nPanasonic is an Equal Opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity, sex, sexual orientation, national origin, disability status, protected veteran status, and any other characteristic protected by law. All qualified individuals are required to perform the essential functions of the job with or without reasonable accommodation.\nThank you for your interest in Panasonic Energy!\n, NV\nR-100662\nShow more\nShow less","all_details":"- Leads the developing, implementing, and managing Panasonic’s SCADA system within the Gigafactory\n- Analyzing product or equipment specifications and performance requirements to determine designs which can be produced by existing manufacturing or processing facilities and methods\n- Takes on technical leader role in development projects, and helps Engineer levels I, II, and II complete tasks for development\n- Determining feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors\n- Providing technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning\n- Conferring with research personnel to clarify or resolve problems and develops design\n- Directing and coordinating manufacturing or building of prototype products or systems\n- Planning and developing experimental test programs\n- Analyzing test data and reports to determine if design meets functional and performance specifications\n- Evaluating engineering test results for possible application to developments of systems or other uses\n- Other duties may be assigned\n- To ensure the health and safety in the workplace and for the protection of our employees, wearing PPE is a requirement for some roles at PECNA and may include equipment such as a full Tyvek suit, safety shoes, gloves, safety glasses, face mask, bump cap, and a full hazmat suit that includes a respirator.\n- Basic\/Required: Bachelor’s Degree in Electrical Engineering, Mechanical Engineering, or related field\n- Preferred: None\n- Minimum of 8+ years of experience with SCADA systems and OPC communication\n- Thorough understanding of feedback control systems and PID controllers\n- Strong understanding of ladder logic\n- Advanced knowledge of best manufacturing and programming practices such as ISA standards and compliance\n- Advanced knowledge of Modbus, Ethercat, Ethernet IP, Profinet, MQTT, OPC UA and SQL\n- Experience designing high availability systems and databases in a manufacturing environment\n- Background working in a high-volume manufacturing environment\n- Understanding of electrical hardware, drawings, sequence control and software design\n- Ability to cooperate and work with related departments including overseas\n- Flexibility to solve issues with first principles thinking\n- Strong computer skills with Microsoft Office Suite, including Word, Excel and PowerPoint\n- Must have working-level knowledge of the English language, including reading, writing, and speaking English\n- Experience programming, installing, and troubleshooting manufacturing image vision systems such as Keyence and Cognex\n- Experience programming, installing, and troubleshooting PLC systems, preferably Mitsubishi or Omron\n- Knowledge of ISA88 physical model systems such as PackML\n- Knowledge and handling about American environmental laws and UL (Underwriters Laboratories)\n- Alignment to Panasonic’s seven (7) core principles (contribution to society, fairness and honesty, cooperation and team spirit, untiring effort for improvement, courtesy and humility, adaptability, gratitude)"}
{"job_id":"4206511474","company":"Canonical","title":"Cloud Field Engineer","location":"Las Vegas, NV","date_posted":"1 month ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Help global companies embrace the latest private cloud infrastructure, Linux and cloud native operations, and open source applications. Our team applies expert insights to real-world customer problems, enabling the enterprise adoption of Linux Ubuntu, OpenStack, Kubernetes and a wide range of associated technology.\nThis role has very diverse responsibilities. The team members are Linux and cloud solutions architects for our customers, designing private and public cloud solutions fitting their workload needs. They are the cloud consultants who work hands-on with the technologies by deploying, testing and handing over the solution to our support or managed services team at the end of a project. They are also software engineers who use Python to develop Kubernetes operators and Linux open source infrastructure-as-code.\nThe people who love this role are developers who like to solve customer problems through architecture, presentations and training.\nLocation:\nThis role will be home based.\nWhat your day will look like\nWork across the entire Linux stack, from kernel, networking, storage, to applications\nWork in Python to design and deliver open source code\nArchitect cloud infrastructure solutions like OpenStack, Kubernetes, Ceph, Hadoop and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud)\nCoach and develop your colleagues where you have insights\nGrow a healthy, collaborative engineering culture in line with the company values\nWork from the comfort of your home\nGlobal travel up to 25% of time for internal and external events\nWhat we are looking for in you\nUniversity degree in Computer Science or related software engineering expertise\nYou have sound knowledge of cloud computing concepts & technologies, such as Kubernetes, OpenStack, AWS, GCP, Azure, Ceph, etc.\nYou have practical knowledge of Linux and networking\nYou have Intermediate to Advanced level of Python programming skills\nYou are a dynamic person who loves to jump in new projects and interact with people\nYou have a demonstrated drive for continual learning\nExcellent communication and presentation skills (English)\nYou have great organisational skills and follow-up reliably on commitments\n(Optional) You speak a second language\nWhat you'll learn\nOpenStack and Kubernetes infrastructure\nLinux Ubuntu and networking knowledge\nWide range of open source applications and skills\nWork directly with customers in a range of different businesses\nReal-life and hands-on exposure to a wide range of emerging technologies and tools\nWhat we offer you\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven quarterly bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues from your team and others\nPriority Pass for travel and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.\nCanonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\n#stack\nShow more\nShow less","all_details":"- Work across the entire Linux stack, from kernel, networking, storage, to applications\n- Work in Python to design and deliver open source code\n- Architect cloud infrastructure solutions like OpenStack, Kubernetes, Ceph, Hadoop and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud)\n- Coach and develop your colleagues where you have insights\n- Grow a healthy, collaborative engineering culture in line with the company values\n- Work from the comfort of your home\n- Global travel up to 25% of time for internal and external events\n- University degree in Computer Science or related software engineering expertise\n- You have sound knowledge of cloud computing concepts & technologies, such as Kubernetes, OpenStack, AWS, GCP, Azure, Ceph, etc.\n- You have practical knowledge of Linux and networking\n- You have Intermediate to Advanced level of Python programming skills\n- You are a dynamic person who loves to jump in new projects and interact with people\n- You have a demonstrated drive for continual learning\n- Excellent communication and presentation skills (English)\n- You have great organisational skills and follow-up reliably on commitments\n- (Optional) You speak a second language\n- OpenStack and Kubernetes infrastructure\n- Linux Ubuntu and networking knowledge\n- Wide range of open source applications and skills\n- Work directly with customers in a range of different businesses\n- Real-life and hands-on exposure to a wide range of emerging technologies and tools\n- Distributed work environment with twice-yearly team sprints in person - we've been working remotely since 2004!\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues from your team and others\n- Priority Pass for travel and travel upgrades for long haul company events"}
{"job_id":"4215959913","company":"Canonical","title":"Security Software Engineer","location":"Las Vegas, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"This is a general track for security-focused engineering in every team at Canonical, across all levels of seniority. Apply here if you are already an exceptional security-focused software engineer.\nMost product engineering teams at Canonical include one or two spaces for dedicated security-oriented software engineers. Their role is to challenge the entire team to think more deeply about security. They contribute to the product as engineers too, but their primary focus is to improve security through state of the art practices - from table-top threat model exercises to architecture reviews, from extended security testing with fuzzers and static analysis tools to external security analyst liaison.\nWe also build a number of products that are entirely motivated by security technology and requirements, such as our AppArmor kernel investments and our hardening, compliance and certification toolkits for Ubuntu.\nAs the publisher of Ubuntu we also handle long-term security response and hardening for the entire operating system and open source universe. Working with tens of thousands of upstreams means that we need to be fluent in every major programming language, and design, build and adopt sophisticated tools that enable us to work at scale and speed with confidence.\nThese roles encompass all aspects of product security, including feature development, vulnerability response, proactive security and open source community participation. All security roles interact closely with many of the other Canonical engineering and development teams, Canonical customers and our partners across the open source community.\nLocation: We have open roles for security specialist software engineers in every timezone.\nWhat you'll do\nSecurity roles might tackle any of the following:\nDefine, implement and document new security features\nLead security-oriented thinking in a product engineering team\nAnalyze, fix, and test vulnerabilities in Canonical and open source Software\nContribute to Ubuntu and upstream projects to benefit the community\nAudit and analyze source code for vulnerabilities\nIntegrate new tools in our security infrastructure, pipelines and processes\nAchieve and retain various security certifications\nExtend and enhance Linux cryptographic components - specifically with modules such as OpenSSL\/Libgcrypt - with the features and functionality required for country-specific compliance such as FIPS and CC certification\nWork with external partners to develop CIS benchmarks\nDesign and develop hardening automation for Ubuntu\nMonitor the security industry for new developments\nDevelop, test and maintain new software capabilities\nProvide guidance and support to other engineering teams\nWhat we are looking for in you\nAn exceptional academic track record from both high school and university\nUndergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\nDrive and a track record of going above-and-beyond expectations\nA thorough understanding of the common categories of security vulnerabilities\nModern engineering techniques to find and fix them\nFamiliarity with open source development tools and methodologies\nSkill in one or more of C, Python, Go, Rust, Java, Ruby or PHP\nExperience as a security champion\nExperience driving security within a wider SDLC process\nProfessional written and spoken English\nExperience with Linux (Debian or Ubuntu preferred)\nExcellent interpersonal skills, curiosity, flexibility, and accountability\nPassion, thoughtfulness, and self-motivation\nExcellent communication and presentation skills\nResult-oriented, with a personal drive to meet commitments\nAbility to travel twice a year, for company events up to two weeks each\nOptional skills we also value\nClear and effective communication with the team and Ubuntu community members\nExperience working with Linux Kernel\nSecurity Certification experience and knowledge in FIPS and\/or CC\nExperience with OVAL (Open Vulnerability Assessment Language)\nKnowledge of and familiarity with low-level Linux cryptography APIs\nDemonstrated high learning ability\nPerformance engineering experience\nWhat we offer you\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Define, implement and document new security features\n- Lead security-oriented thinking in a product engineering team\n- Analyze, fix, and test vulnerabilities in Canonical and open source Software\n- Contribute to Ubuntu and upstream projects to benefit the community\n- Audit and analyze source code for vulnerabilities\n- Integrate new tools in our security infrastructure, pipelines and processes\n- Achieve and retain various security certifications\n- Extend and enhance Linux cryptographic components - specifically with modules such as OpenSSL\/Libgcrypt - with the features and functionality required for country-specific compliance such as FIPS and CC certification\n- Work with external partners to develop CIS benchmarks\n- Design and develop hardening automation for Ubuntu\n- Monitor the security industry for new developments\n- Develop, test and maintain new software capabilities\n- Provide guidance and support to other engineering teams\n- An exceptional academic track record from both high school and university\n- Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\n- Drive and a track record of going above-and-beyond expectations\n- A thorough understanding of the common categories of security vulnerabilities\n- Modern engineering techniques to find and fix them\n- Familiarity with open source development tools and methodologies\n- Skill in one or more of C, Python, Go, Rust, Java, Ruby or PHP\n- Experience as a security champion\n- Experience driving security within a wider SDLC process\n- Professional written and spoken English\n- Experience with Linux (Debian or Ubuntu preferred)\n- Excellent interpersonal skills, curiosity, flexibility, and accountability\n- Passion, thoughtfulness, and self-motivation\n- Excellent communication and presentation skills\n- Result-oriented, with a personal drive to meet commitments\n- Ability to travel twice a year, for company events up to two weeks each\n- Clear and effective communication with the team and Ubuntu community members\n- Experience working with Linux Kernel\n- Security Certification experience and knowledge in FIPS and\/or CC\n- Experience with OVAL (Open Vulnerability Assessment Language)\n- Knowledge of and familiarity with low-level Linux cryptography APIs\n- Demonstrated high learning ability\n- Performance engineering experience\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass, and travel upgrades for long haul company events"}
{"job_id":"4229360893","company":"Affirm","title":"Staff Software Engineer, Full Stack (Agent Experience)","location":"Las Vegas, NV","date_posted":"9 hours ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services","company_website":null,"workplace_type":null,"description":"Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\nThe Agent Enablement team is responsible for ensuring our 2000+ customer service agents have the right tools, in the right place, at the right time in order to support Affirm's millions of customers. Composed of three teams and 25 engineers located throughout North America, we are a diverse and passionate team that is applying the latest Generative AI technologies to deliver a world class experience for our customers and agents.\nWhat You'll Do\nYou will be responsible for setting technical strategy for your team on a year-long time scale, and help your team tie it together with critical, business-impacting projects.\nYou will collaborate across teams in the product development lifecycle by collaborating with product management, design & analytics to ensure technical sustainability, risks and trade-offs are well understood and managed.\nYou will act as a force-multiplier for your team through your definition and advocacy of technical solutions and operational processes.\nYou take ownership of your team’s operations and availability by ensuring you have the right monitoring, triage rotations, playbooks, polcities, testing and alerting in place to support “keep the lights on” & on-call efforts.\nYou will foster a culture of quality and ownership on your team by setting code review and design standards for your team, and advocating for them beyond your team through your writing and tech talks.\nYou will help develop talent on your team by providing feedback and guidance, and leading by example.\nWhat We Look For\nYou have a total of 8+ years of experience as a software engineer.\nYou are proficient in designing, developing and launching backend systems at scale technologies like Python, Kotlin, AWS, MySQL, and Kubernetes\nYou are proficient in developing web apps using declarative UI frameworks like React or Vue.\nYou are proficient in developing web apps using declarative UI frameworks like React or Vue.\nYou are a productivity multiplier for your teammates, supporting them in both their day to day tasks and in their long term technical growth.\nYou have experience delivering major features, system components or deprecating existing functionality in a system through the definition of a technical and execution plan. You write high quality code that is easily understood and used by others.\nYou thrive in ambiguity, and are comfortable moving from low level language idioms all the way to the architecture of large systems to understand how they work.\nYour growth and impact trajectory demonstrates that you have mastered gathering and iterating on feedback from your engineering and cross-functional peers.\nYou have strong verbal and written communication skills that support effective collaboration with our global engineering team.\nThis position requires either equivalent practical experience or a Bachelor’s degree in a related field.\nBase Pay Grade\n- P\nEquity Grade\n- 13\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $225,000 - $275,000\nUSA base pay range (all other U.S. states) per year: $200,000 - $250,000\nLocation: Remote - US\nAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.\nBenefits\nWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:\nHealth care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\nFlexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\nTime off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\nESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount\nWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.\n[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.\nBy clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.\nShow more\nShow less","all_details":"- You will be responsible for setting technical strategy for your team on a year-long time scale, and help your team tie it together with critical, business-impacting projects.\n- You will collaborate across teams in the product development lifecycle by collaborating with product management, design & analytics to ensure technical sustainability, risks and trade-offs are well understood and managed.\n- You will act as a force-multiplier for your team through your definition and advocacy of technical solutions and operational processes.\n- You take ownership of your team’s operations and availability by ensuring you have the right monitoring, triage rotations, playbooks, polcities, testing and alerting in place to support “keep the lights on” & on-call efforts.\n- You will foster a culture of quality and ownership on your team by setting code review and design standards for your team, and advocating for them beyond your team through your writing and tech talks.\n- You will help develop talent on your team by providing feedback and guidance, and leading by example.\n- You have a total of 8+ years of experience as a software engineer.\n- You are proficient in designing, developing and launching backend systems at scale technologies like Python, Kotlin, AWS, MySQL, and Kubernetes\n- You are proficient in developing web apps using declarative UI frameworks like React or Vue.\n- You are proficient in developing web apps using declarative UI frameworks like React or Vue.\n- You have experience delivering major features, system components or deprecating existing functionality in a system through the definition of a technical and execution plan. You write high quality code that is easily understood and used by others.\n- You thrive in ambiguity, and are comfortable moving from low level language idioms all the way to the architecture of large systems to understand how they work.\n- Your growth and impact trajectory demonstrates that you have mastered gathering and iterating on feedback from your engineering and cross-functional peers.\n- You have strong verbal and written communication skills that support effective collaboration with our global engineering team.\n- This position requires either equivalent practical experience or a Bachelor’s degree in a related field.\n- Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\n- Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\n- Time off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\n- ESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount"}
{"job_id":"4214876163","company":"Affirm","title":"Senior Staff Software Engineer, Backend (Discovery \/ Search)","location":"Las Vegas, NV","date_posted":"2 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Financial Services","company_website":null,"workplace_type":null,"description":"Affirm is reinventing credit to make it more honest and friendly, giving consumers the flexibility to buy now and pay later without any hidden fees or compounding interest.\nAffirm is looking for a Senior Staff Software Engineer to take on a key role in defining the technical direction and foster innovation across the Discovery Domain engineering organization. You’ll collaborate with engineering leaders, cross-functional teams, and stakeholders to build scalable, reliable, and high-performing solutions. You'll help shape best practices, guide architectural choices, and drive the successful delivery of critical initiatives. This role requires a high level of technical ability, leadership skills, strong cross-functional communication, and a creative mindset. You will be responsible for building large-scale distributed systems, and developing the overall technology strategy for the Discovery domain within our engineering org.\nDiscovery domain focuses on building features that bring in new users, engage existing ones, encourage repeat use of Affirm products, and provide value to our customers within the app and marketplace. We own systems like search, read-optimized merchant and consumer data, marketing, and marketplace tooling that provide Affirm consumers a personalized and segmented way to discover and activate Affirm consumer-facing products.\nWhat You'll Do\nBuild a multi year technical strategy for Discovery domain focused on product roadmap, availability and scale.\nPartner with the architecture team at Affirm to guide architectural choices within the Discovery domain.\nInfluence or make product decisions\/scope and determine the right technical tradeoffs to deliver customer value quickly.\nDesign, implement, and extend core platform services and APIs to enable new products and features to be built\nArchitect and build the next version of our data-processing pipelines\nCreate 3rd party developer APIs and tools\nAnalyze\/debug performance issues across distributed services\nPlan, design, and build our core platform software and systems to scale with an increasing number of users, features, business requirements, partners, and new engineers\nWhat We Look For\nPassionate: Passionate about Affirm's Mission: \"Deliver Honest Financial Products that improve lives\"\nTechnical: Solid CS fundamentals and fluency of a dynamically typed language. We primarily use Python, but members of our team have backgrounds in a wide range of technologies\nCollaborative: Enjoys cross team collaboration especially with product managers and designers\nHumble: You have the humility and self-awareness to understand and navigate the unknown\nUser Focused: Cares about the details in the user experience\nExperienced: Background building real-time distributed web services, developing systems in web application frameworks and implementing highly available data storage\nThis position requires either equivalent practical experience or a Bachelor’s degree in a related field.\nBase Pay Grade\n- R\nEquity Grade\n- 15\nEmployees new to Affirm typically come in at the start of the pay range. Affirm focuses on providing a simple and transparent pay structure which is based on a variety of factors, including location, experience and job-related skills.\nBase pay is part of a total compensation package that may include equity rewards, monthly stipends for health, wellness and tech spending, and benefits (including 100% subsidized medical coverage, dental and vision for you and your dependents.)\nUSA base pay range (CA, WA, NY, NJ, CT) per year: $260,000 - $310,000\nUSA base pay range (all other U.S. states) per year: $232,000 - $282,000\nAffirm is proud to be a remote-first company! The majority of our roles are remote and you can work almost anywhere within the country of employment. Affirmers in proximal roles have the flexibility to work remotely, but will occasionally be required to work out of their assigned Affirm office. A limited number of roles remain office-based due to the nature of their job responsibilities.\nBenefits\nWe’re extremely proud to offer competitive benefits that are anchored to our core value of people come first. Some key highlights of our benefits package include:\nHealth care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\nFlexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\nTime off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\nESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount\nWe believe It’s On Us to provide an inclusive interview experience for all, including people with disabilities. We are happy to provide reasonable accommodations to candidates in need of individualized support during the hiring process.\n[For U.S. positions that could be performed in Los Angeles or San Francisco] Pursuant to the San Francisco Fair Chance Ordinance and Los Angeles Fair Chance Initiative for Hiring Ordinance, Affirm will consider for employment qualified applicants with arrest and conviction records.\nBy clicking \"Submit Application,\" you acknowledge that you have read Affirm's Global Candidate Privacy Notice and hereby freely and unambiguously give informed consent to the collection, processing, use, and storage of your personal information as described therein.\nShow more\nShow less","all_details":"- Build a multi year technical strategy for Discovery domain focused on product roadmap, availability and scale.\n- Partner with the architecture team at Affirm to guide architectural choices within the Discovery domain.\n- Influence or make product decisions\/scope and determine the right technical tradeoffs to deliver customer value quickly.\n- Design, implement, and extend core platform services and APIs to enable new products and features to be built\n- Architect and build the next version of our data-processing pipelines\n- Create 3rd party developer APIs and tools\n- Analyze\/debug performance issues across distributed services\n- Plan, design, and build our core platform software and systems to scale with an increasing number of users, features, business requirements, partners, and new engineers\n- Passionate: Passionate about Affirm's Mission: \"Deliver Honest Financial Products that improve lives\"\n- Technical: Solid CS fundamentals and fluency of a dynamically typed language. We primarily use Python, but members of our team have backgrounds in a wide range of technologies\n- Collaborative: Enjoys cross team collaboration especially with product managers and designers\n- Humble: You have the humility and self-awareness to understand and navigate the unknown\n- User Focused: Cares about the details in the user experience\n- Experienced: Background building real-time distributed web services, developing systems in web application frameworks and implementing highly available data storage\n- This position requires either equivalent practical experience or a Bachelor’s degree in a related field.\n- Health care coverage - Affirm covers all premiums for all levels of coverage for you and your dependents\n- Flexible Spending Wallets - generous stipends for spending on Technology, Food, various Lifestyle needs, and family forming expenses\n- Time off - competitive vacation and holiday schedules allowing you to take time off to rest and recharge\n- ESPP - An employee stock purchase plan enabling you to buy shares of Affirm at a discount"}
{"job_id":"4212748244","company":"Nevada National Security Sites","title":"Senior Cyber Security Analyst (Splunk)","location":"North Las Vegas, NV","date_posted":"4 days ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Information Technology","industries":"Government Administration","company_website":null,"workplace_type":null,"description":"Job Description\nMission Support and Test Services, LLC (MSTS) manages and operates the Nevada National Security Site (NNSS) for the U.S. National Nuclear Security Administration (NNSA). Our MISSION is to help ensure the security of the United States and its allies by providing high-hazard experimentation and incident response capabilities through operations, engineering, education, field, and integration services and by acting as environmental stewards to the Site’s Cold War legacy. Our VISION is to be the user site of choice for large-scale, high-hazard, national security experimentation, with premier facilities and capabilities below ground, on the ground, and in the air. (See NNSS.gov for our unique capabilities.) Our 2,750+ professional, craft, and support employees are called upon to innovate, collaborate, and deliver on some of the more difficult nuclear security challenges facing the world today.\nMSTS offers our full-time employees highly competitive salaries and benefits packages including medical, dental, and vision; both a pension and a 401k; paid time off and 96 hours of paid holidays; relocation (if located more than 75 miles from work location); tuition assistance and reimbursement; and more.\nMSTS is a limited liability company consisting of Honeywell International Inc. (Honeywell), Jacobs Engineering Group Inc. (Jacobs), and HII Nuclear Inc.\nResponsibilities\nMSTS is seeking an experienced candidate for a Senior Splunk Engineer. The Senior Splunk Engineer will play a critical role in safeguarding company infrastructure from cyber threats and attacked by delivering innovative solutions which enhance the capabilities of the Cyber Security section to detect and identify threat activity and system intrusions. The position is responsible for a range of Splunk development and configuration activities including system deployment, Splunk app implementation, data onboarding, and other Splunk integrations.\nKey Responsibilities\nAssist in managing the organization's Splunk environment providing fundamental knowledge of the Splunk license manager, indexers, and search heads.\nConduct a range of Splunk development and configuration activities including system deployment, Splunk app implementation, data onboarding, and other Splunk integrations.\nMature and maintain premium Splunk applications to include Enterprise Security, SOAR, & ITSI, as well as research new applications to modernize the deployment.\nDevelop SOAR playbooks to minimize security incident response time and develop advanced techniques to identify and mitigate vulnerabilities.\nCollaboratively design and implement custom Splunk solutions which satisfy project requirements.\nUse established standards, practices, and procedures as well as an increasing technical knowledge to solve problems and complete projects.\nReview current Cyber Security threat information and assist the Threat Evaluation Team with mitigating vulnerabilities identified.\nCollaborate with other outside Cyber Security interests such as Counterintelligence, other DOE sites, US CERT, and law enforcement.\nAssist with data calls, FISMA reporting, compliance scanning and reporting, continuous monitoring, and compiling reports for auditors.\nPerform other duties assigned by Management.\nQualifications\nBachelor’s degree or equivalent training and experience in a computer-related field and at least 5 years of related experience.\nPreferred Qualifications:\nSplunk Enterprise Certified Architect\nSplunk Enterprise Security Certified Administrator\nSplunk SOAR Certified Automation Developer\nSplunk IT Service Intelligence Certified Administrator\nA strong IT background, including networking fundamentals and system. Able to demonstrate thorough understanding of basic principles, theories, standards, practices, protocols, and procedures used in Cyber Security as well as knowledge of Linux administration services.\nExperience deploying, configuring, and managing Splunk systems.\nExperience with centralized logging and filtering (Splunk, syslog).\nExperience deploying and troubleshooting large clustered Splunk deployments.\nExperience onboarding various data sources into Splunk using multiple input techniques.\nExperience developing and maintaining health monitoring for a large Splunk deployment and data sources.\nExperience managing Splunk via the command-line interface.\nExperience with DevOps platforms and tools (Jira, git, Jenkins, Ansible).\nA strong understanding of software development best practices and design patterns.\nModern programming skills in any language, including version control, test-driven development, and debugging.\nKnowledge, experience, and scripting skills (Bash, Python, PowerShell, etc.).\nFamiliarity with compliance frameworks, security best practices, and product security baselines.\nExperience using configuration management tools in a production environment.\nPossess considerable organization and project management skills.\nAbility to develop Security Orchestration Automation and Response (SOAR) solutions including playbooks and integrate with Splunk.\nAbility to maintain strict confidentiality.\nAbility to communicate effectively in English, both verbally and in writing, sufficient to communicate with co-workers, customers, write clear and concise reports, gather information, and collect information.\nAbility to use multiple electronic devices including standard office machines, cellular phones, and security appliances.\nGeneral understanding of cybersecurity controls used to mitigate vulnerabilities.\nThe primary work location will be at the Losee Road facility located in North Las Vegas, Nevada.\nWork schedule will be 4\/10's Monday through Thursday (subject to change).\nPre-placement physical examination, which includes a drug-screen, is required. MSTS maintains a substance abuse policy that includes random drug testing.\nMust possess a valid driver's license\nMSTS is required by DOE directive to conduct a pre-employment drug test and background review that includes checks of personal references, credit, law enforcement records, and employment\/education verifications. Applicants offered employment with MSTS are also subject to a federal background investigation to meet the requirements for access to classified information or matter if the duties of the position require a DOE security clearance. Substance abuse or illegal drug use, falsification of information, criminal activity, serious misconduct or other indicators of untrustworthiness can cause a clearance to be denied or terminated by DOE, resulting in the inability to perform the duties assigned and subsequent termination of employment. In addition, Applicants for employment must be able to obtain and maintain a DOE Q-level security clearance, which requires U.S. citizenship, at least 18 years of age. Reference DOE Order 472.2 , “Personnel Security”. If you hold more than one citizenship (i.e., of the U.S. and another country), your ability to obtain a security clearance may be impacted.\nDepartment of Energy Q Clearance\n(position will be cleared to this level). Reviews and tests for the absence of any illegal drug as defined in 10 CFR Part 707.4 , “Workplace Substance Abuse Programs at DOE Sites,” will be conducted. Applicant selected will be subject to a Federal background investigation, required to participate in subsequent reinvestigations, and must meet the eligibility requirements for access to classified matter. Successful completion of a counterintelligence evaluation, which may include a counterintelligence-scope polygraph examination, may also be required. Reference 10 CFR Part 709 , “Counterintelligence Evaluation Program.”\nMSTS is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, veteran status or other characteristics protected by law. MSTS is a background screening, drug-free workplace.\nAnnual salary range for this position is: $95,139.20 - $142,708.80\nStarting salary is determined based on the position market value, the individual candidate education and experience and internal equity.\nShow more\nShow less","all_details":"- MSTS offers our full-time employees highly competitive salaries and benefits packages including medical, dental, and vision; both a pension and a 401k; paid time off and 96 hours of paid holidays; relocation (if located more than 75 miles from work location); tuition assistance and reimbursement; and more.\n- MSTS is a limited liability company consisting of Honeywell International Inc. (Honeywell), Jacobs Engineering Group Inc. (Jacobs), and HII Nuclear Inc.\n- Assist in managing the organization's Splunk environment providing fundamental knowledge of the Splunk license manager, indexers, and search heads.\n- Conduct a range of Splunk development and configuration activities including system deployment, Splunk app implementation, data onboarding, and other Splunk integrations.\n- Mature and maintain premium Splunk applications to include Enterprise Security, SOAR, & ITSI, as well as research new applications to modernize the deployment.\n- Develop SOAR playbooks to minimize security incident response time and develop advanced techniques to identify and mitigate vulnerabilities.\n- Collaboratively design and implement custom Splunk solutions which satisfy project requirements.\n- Use established standards, practices, and procedures as well as an increasing technical knowledge to solve problems and complete projects.\n- Review current Cyber Security threat information and assist the Threat Evaluation Team with mitigating vulnerabilities identified.\n- Collaborate with other outside Cyber Security interests such as Counterintelligence, other DOE sites, US CERT, and law enforcement.\n- Assist with data calls, FISMA reporting, compliance scanning and reporting, continuous monitoring, and compiling reports for auditors.\n- Perform other duties assigned by Management.\n- Bachelor’s degree or equivalent training and experience in a computer-related field and at least 5 years of related experience.\n- Preferred Qualifications:\n- Splunk Enterprise Certified Architect\n- Splunk Enterprise Security Certified Administrator\n- Splunk SOAR Certified Automation Developer\n- Splunk IT Service Intelligence Certified Administrator\n- A strong IT background, including networking fundamentals and system. Able to demonstrate thorough understanding of basic principles, theories, standards, practices, protocols, and procedures used in Cyber Security as well as knowledge of Linux administration services.\n- Experience deploying, configuring, and managing Splunk systems.\n- Experience with centralized logging and filtering (Splunk, syslog).\n- Experience deploying and troubleshooting large clustered Splunk deployments.\n- Experience onboarding various data sources into Splunk using multiple input techniques.\n- Experience developing and maintaining health monitoring for a large Splunk deployment and data sources.\n- Experience managing Splunk via the command-line interface.\n- Experience with DevOps platforms and tools (Jira, git, Jenkins, Ansible).\n- A strong understanding of software development best practices and design patterns.\n- Modern programming skills in any language, including version control, test-driven development, and debugging.\n- Knowledge, experience, and scripting skills (Bash, Python, PowerShell, etc.).\n- Familiarity with compliance frameworks, security best practices, and product security baselines.\n- Experience using configuration management tools in a production environment.\n- Possess considerable organization and project management skills.\n- Ability to develop Security Orchestration Automation and Response (SOAR) solutions including playbooks and integrate with Splunk.\n- Ability to maintain strict confidentiality.\n- Ability to communicate effectively in English, both verbally and in writing, sufficient to communicate with co-workers, customers, write clear and concise reports, gather information, and collect information.\n- Ability to use multiple electronic devices including standard office machines, cellular phones, and security appliances.\n- General understanding of cybersecurity controls used to mitigate vulnerabilities.\n- The primary work location will be at the Losee Road facility located in North Las Vegas, Nevada.\n- Work schedule will be 4\/10's Monday through Thursday (subject to change).\n- Pre-placement physical examination, which includes a drug-screen, is required. MSTS maintains a substance abuse policy that includes random drug testing.\n- Must possess a valid driver's license"}
{"job_id":"4187576279","company":"Canonical","title":"System Software Engineer - Rust compiler, tooling, and ecosystem","location":"Las Vegas, NV","date_posted":"1 month ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder-led, profitable, and growing.\nWe are hiring a\nSystem Software Engineer for Rust compiler, tooling, and ecosystem\nWe are building a new team to focus on the Rust programming language and its ecosystem on Ubuntu. They will deliver the best possible Rust runtime, developer experience and supporting tooling in Ubuntu. We are keen to ensure that the cutting edge of modern programming languages innovation is available to Ubuntu users, to lay the foundation for future inventions and open source communities.\nThis is an exciting opportunity for a software engineer passionate about open source software, Linux systems, software architectures and Rust programming language. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, a growing international software company and make Ubuntu the best operating system to develop and run Rust applications in the cloud, in datacenters, in containers, directly on the operating system, and anywhere Ubuntu can run.\nThe Ubuntu Foundations Team delivers the core Ubuntu system, the base for the entire Ubuntu family of products and services. Ubuntu strives to deliver the latest-best free software components, in an easy to use and highly reliable form. We build on the technical excellence of Debian and bring additional focus and shape to the solutions we offer the industry.\nPart of the Ubuntu Foundations team, you will work on some of the most critical toolchains involved in the making of Ubuntu but also pillars of the modern software ecosystem. You will leverage your experience and passion in Rust to make Ubuntu the best platform to develop, distribute and consume software built with Rust. Applicants will be passionate about the future of Rust, of Ubuntu, mindful of the dynamics of the open-source ecosystem, and equally aware of the needs of large but innovative organizations. Applicants will drive best in class integration in Ubuntu from desktop to cloud in a secure, reliable, performing, efficient and future-proof fashion.\nYou will be discussing design with other team members and mentor less senior engineers and participate in code reviews and design reviews. You will also be working with other teams to ensure architecture decisions improve the overall performance and experience of Ubuntu. Your role as part of the Ubuntu Foundations team will have an impact on every aspect of Ubuntu from Desktop, Server, Ubuntu Core and also cloud images.\nLocation:\nThis role will be based remotely in the AMERICAS region\nThe role entails\nCollaborate proactively with a distributed team\nSelect, integrate and package best-of-breed tooling with Ubuntu to improve developer and operator experience with Rust\nWrite high-quality code to create new features\nDebug issues and produce high-quality code to fix them\nReview code produced by other engineers\nDiscuss ideas and collaborate on finding good solutions\nWork from home with global travel 2 to 4 weeks a year for internal and external events\nWhat we are looking for in you\nYou have relevant Rust experience, ideally in the world of cloud-native software and Linux\nYou have experience or are interested in learning how to package software for Debian and Ubuntu\nYou are a long-time Linux user\nExceptional academic track record from both high school and university\nUndergraduate degree in a technical subject or a compelling narrative about your alternative chosen path\nYou love technology and working with brilliant people\nYou are passionate, curious, flexible, articulate, and accountable\nYou value soft skills and are passionate, enterprising, thoughtful, and self-motivated\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nTeam Member Assistance Program & Wellness Platform\nOpportunity to travel to new locations to meet colleagues\nPriority Pass and travel upgrades for long-haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Collaborate proactively with a distributed team\n- Select, integrate and package best-of-breed tooling with Ubuntu to improve developer and operator experience with Rust\n- Write high-quality code to create new features\n- Debug issues and produce high-quality code to fix them\n- Review code produced by other engineers\n- Discuss ideas and collaborate on finding good solutions\n- Work from home with global travel 2 to 4 weeks a year for internal and external events\n- You have relevant Rust experience, ideally in the world of cloud-native software and Linux\n- You have experience or are interested in learning how to package software for Debian and Ubuntu\n- You are a long-time Linux user\n- Exceptional academic track record from both high school and university\n- Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path\n- You love technology and working with brilliant people\n- You are passionate, curious, flexible, articulate, and accountable\n- You value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Team Member Assistance Program & Wellness Platform\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass and travel upgrades for long-haul company events"}
{"job_id":"4212774786","company":"Canonical","title":"Senior Software Engineer - packaging - optimize Ubuntu Server","location":"Las Vegas, NV","date_posted":"3 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder led, profitable and growing.\nCanonical's Ubuntu Engineering Server Team is looking for open source enthusiasts to help build the distro of the future. The Server Team maintains and packages a wide variety of software including webservers, databases, and virtualization and containerization stacks. This is an exciting opportunity for you, a software engineer passionate about open source software. Come build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, a growing international software company and help us to bring free software to the widest audience.\nUbuntu Server is a platform that enables amazing technology the whole world over, and is the #1 operating system in the public clouds. Applicants to this role will have the opportunity to help with everything that goes into evolving Ubuntu. You will get to work with our experienced team and have the benefits of learning and growing alongside the best engineers in the business.\nThe role entails\nCollaborating proactively within a distributed team\nFostering a software ecosystem with seamless user experience for all Ubuntu users\nEvaluating contributions of other engineers to maintain high-quality software standards.\nPlaying a role in shaping the future of Ubuntu via both - new ideas in your areas of interest and advising on work being done elsewhere\nCollaborating with other teams in the Ubuntu and Debian communities, with upstream projects, and commercially supported customers\nOwning the maintenance of Ubuntu Server packages. Specifically but not limited to:\nTraditional server workloads (web servers, databases, network services, etc)\nVirtualisation and Containers\nPackage management and dependencies\nLanguage runtimes and toolchains\nWork from home with global travel 2 to 4 weeks for internal and external events\nWhat we are looking for in you\nYou love technology and working with brilliant people\nYou are curious, flexible, articulate, and accountable\nYou value soft skills and are passionate, enterprising, thoughtful, and self-motivated\nInterest or experience in open source maintenance or contributions\nAble to replay complex workloads and systems. Able to write detailed test plans and reproducibility steps.\nFeel comfortable contributing and debugging many languages such as C\/C++, Python, Rust, Go, Ruby, PHP\nExperience in packaging in one or more ecosystems. This could be language specific systems (Python wheels, Rust Crates, Go Modules, or other equivalent) or any distro package format (deb, rpm, NixOS, or other equivalent).\nExperience using and creating containers and virtual machines\nYou have a Bachelor's or equivalent in Computer Science, STEM or similar degree (or any higher) or equivalent professional experience (5+ years of professional experience)\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nEmployee Assistance Programme\nOpportunity to travel to new locations to meet colleagues\nPriority Pass, and travel upgrades for long haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004. Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Collaborating proactively within a distributed team\n- Fostering a software ecosystem with seamless user experience for all Ubuntu users\n- Evaluating contributions of other engineers to maintain high-quality software standards.\n- Playing a role in shaping the future of Ubuntu via both - new ideas in your areas of interest and advising on work being done elsewhere\n- Collaborating with other teams in the Ubuntu and Debian communities, with upstream projects, and commercially supported customers\n- Owning the maintenance of Ubuntu Server packages. Specifically but not limited to:\n- Traditional server workloads (web servers, databases, network services, etc)\n- Virtualisation and Containers\n- Package management and dependencies\n- Language runtimes and toolchains\n- Work from home with global travel 2 to 4 weeks for internal and external events\n- You love technology and working with brilliant people\n- You are curious, flexible, articulate, and accountable\n- You value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n- Interest or experience in open source maintenance or contributions\n- Able to replay complex workloads and systems. Able to write detailed test plans and reproducibility steps.\n- Feel comfortable contributing and debugging many languages such as C\/C++, Python, Rust, Go, Ruby, PHP\n- Experience in packaging in one or more ecosystems. This could be language specific systems (Python wheels, Rust Crates, Go Modules, or other equivalent) or any distro package format (deb, rpm, NixOS, or other equivalent).\n- Experience using and creating containers and virtual machines\n- You have a Bachelor's or equivalent in Computer Science, STEM or similar degree (or any higher) or equivalent professional experience (5+ years of professional experience)\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Employee Assistance Programme\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass, and travel upgrades for long haul company events"}
{"job_id":"4212773858","company":"Canonical","title":"Senior Software Engineer - MAAS","location":"Las Vegas, NV","date_posted":"3 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Software Development","company_website":null,"workplace_type":null,"description":"Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.\nThe company is founder-led, profitable, and growing.\nThe Canonical MAAS team is responsible for delivering our Metal As A Service hyperscale provisioning technology. Ubuntu strives to be the most scalable, cloud ready server distribution and MAAS is our platform to get it there. MAAS is a rapidly evolving software stack written in Python and Go, and we are looking for experienced software engineers who understand performance at scale, networking, storage and usability.\nApplicants should be passionate about the future of Ubuntu and be able to show technical leadership with a globally distributed team of engineers who share that passion. This position requires international travel several times a year.\nThis role entails\nDevelop MAAS core components and features to make MAAS the #1 bare metal cloud system.\nShape the architecture of MAAS to make it simpler, faster and easier to use.\nCollaborate with other teams to ensure MAAS works well with other tools and is released on time.\nContribute your improvements to our continuous integration environment, tests and practices, to maintain fast feedback and good test coverage.\nContribute to documentation of current and existing features, making it world-class resource for Data Centre operators and users.\nProvide technical communication and collaboration with other teams where appropriate.\nTake personal ownership of problems and drive them to solutions.\nTravel internationally a few times a year to meet and collaborate with your and other teams.\nWhat we are looking for in you\nPassionate about open source software, Linux, and Data Centre automation\nSolid track record of professional software development experience in Python, Go for back-end roles, or TypeScript, React for front-end roles.\nCapacity to learn quickly about new systems and techniques\nExcellent logic, problem solving, and troubleshooting skills\nStrong English language communication skills - both written and verbal\nExperience with Linux server technologies, including but not limited to Virtualization (KVM), Containers (LXC), etc.\nYou have a Bachelor's or equivalent in Computer Science, STEM or similar degree\nKnowledge of network technologies, including PXE, DHCP, TFTP, DNS, NTP\nSome experience with Baseboard Management Controllers and Protocols (Redfish, IPMI, AMT and others)\nStrong experience with networking, storage technologies and Cloud hosting and infrastructure.\nIdeally, experience of large-scale physical server provisioning and automation, including rapid deployment, configuration, management and service orchestration.\nFamiliarity with some of the open source development tools and methodologies used in creation of several Ubuntu projects (MAAS, Juju, Ubuntu Server, LXD, Ubuntu Core), such as Launchpad, Debian packaging tools (APT, dpkg) and snapcraft.\nAn exceptional academic track record from both high school and preferably university.\nWillingness to travel up to 4 times a year for internal events\nWhat we offer colleagues\nWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\nDistributed work environment with twice-yearly team sprints in person\nPersonal learning and development budget of USD 2,000 per year\nAnnual compensation review\nRecognition rewards\nAnnual holiday leave\nMaternity and paternity leave\nTeam Member Assistance Program & Wellness Platform\nOpportunity to travel to new locations to meet colleagues\nPriority Pass and travel upgrades for long-haul company events\nAbout Canonical\nCanonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open-source projects and the platform for AI, IoT, and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence; in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since our inception in 2004. Working here is a step into the future and will challenge you to think differently, work smarter, learn new skills, and raise your game.\nCanonical is an equal opportunity employer\nWe are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your identity, we will give your application fair consideration.\nShow more\nShow less","all_details":"- Develop MAAS core components and features to make MAAS the #1 bare metal cloud system.\n- Shape the architecture of MAAS to make it simpler, faster and easier to use.\n- Collaborate with other teams to ensure MAAS works well with other tools and is released on time.\n- Contribute your improvements to our continuous integration environment, tests and practices, to maintain fast feedback and good test coverage.\n- Contribute to documentation of current and existing features, making it world-class resource for Data Centre operators and users.\n- Provide technical communication and collaboration with other teams where appropriate.\n- Take personal ownership of problems and drive them to solutions.\n- Travel internationally a few times a year to meet and collaborate with your and other teams.\n- Passionate about open source software, Linux, and Data Centre automation\n- Solid track record of professional software development experience in Python, Go for back-end roles, or TypeScript, React for front-end roles.\n- Capacity to learn quickly about new systems and techniques\n- Excellent logic, problem solving, and troubleshooting skills\n- Strong English language communication skills - both written and verbal\n- Experience with Linux server technologies, including but not limited to Virtualization (KVM), Containers (LXC), etc.\n- You have a Bachelor's or equivalent in Computer Science, STEM or similar degree\n- Knowledge of network technologies, including PXE, DHCP, TFTP, DNS, NTP\n- Some experience with Baseboard Management Controllers and Protocols (Redfish, IPMI, AMT and others)\n- Strong experience with networking, storage technologies and Cloud hosting and infrastructure.\n- Ideally, experience of large-scale physical server provisioning and automation, including rapid deployment, configuration, management and service orchestration.\n- Familiarity with some of the open source development tools and methodologies used in creation of several Ubuntu projects (MAAS, Juju, Ubuntu Server, LXD, Ubuntu Core), such as Launchpad, Debian packaging tools (APT, dpkg) and snapcraft.\n- An exceptional academic track record from both high school and preferably university.\n- Willingness to travel up to 4 times a year for internal events\n- Distributed work environment with twice-yearly team sprints in person\n- Personal learning and development budget of USD 2,000 per year\n- Annual compensation review\n- Recognition rewards\n- Annual holiday leave\n- Maternity and paternity leave\n- Team Member Assistance Program & Wellness Platform\n- Opportunity to travel to new locations to meet colleagues\n- Priority Pass and travel upgrades for long-haul company events"}
{"job_id":"4207057105","company":"WSP in the U.S.","title":"Rock Mechanics Engineer","location":"Reno, NV","date_posted":"1 week ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Professional Services","company_website":null,"workplace_type":null,"description":"Job Description\nThis Opportunity\nWSP is currently initiating a search for a Rock Mechanics Engineer for our Reno, NV office. The following locations will also be considered: Tucson, AZ. Be involved in projects with our Mine Engineering & Stability Team and be a part of a growing organization that meets our client’s objectives and solves their challenges.\nYour Impact\nSupporting senior and intermediate engineering staff in completion of projects in the area of Open Pit and Underground mining rock mechanics and mine closure\nPerforming field work, data collection, field testing, data analysis, excavation stability assessments, and calculations\nResearching specific rock engineering and mine closure problems\nField work will include some aspects of surveying, drilling coordination, geotechnical core logging\/mapping, and construction monitoring\nData reduction and analysis of investigation data\nPreparing and working with 2D and 3D models\nAssisting with geotechnical characterization and assessments in support of underground, open pit, and mine closure rock mechanics projects\nAssisting with the preparation of technical reports\nRole will include a combination of office and field work\nWork as an individual or as part of a cross-functional team of engineers and scientific professionals to execute project work\nConduct geotechnical engineering studies and surveys to gain further information on a particular design, issue, and\/or to plan for future needs.\nExercise responsible and ethical decision-making regarding company funds, resources and conduct, and adhere to WSP’s Code of Conduct and related policies and procedures.\nPerform additional responsibilities as required by business needs.\nWho You Are\nRequired Qualifications\nBachelor’s Degree in Geotechnical Engineering, or closely related discipline.\n3 to 5 years of relevant post education experience in engineering and prior geotechnical design experience.\nPossesses or eligible to receive Engineer in Training Certification.\nTechnical knowledge of geotechnical engineering including: evaluating slope stability, seismic engineering, retaining wall design, earth retention, rock mechanics, ground improvement techniques, support of excavation, dewatering, design\/build, and the application to permitting and project work-related issues.\nProficient understanding of the disciplines of rock and soil mechanics to perform mine stability analysis of both surface and underground mining operations.\nAbility to make technical computations and calculations involving the application of engineering principles, understanding plans and specifications, and making factual comparisons to the appropriate regulations.\nProject management experience with small to mid-level projects including scoping, and tracking hours and expenses for project work.\nCapable interpersonal and communication skills when interacting with others, expressing ideas effectively and professionally to an engineering and non-engineering audience.\nEffective self-leadership with attention to detail, results orientation, and managing multiple priorities in a dynamic work environment.\nRelevant consulting or operating experience in a mining or consulting setting\nAbility to learn new techniques, perform multiple tasks simultaneously, follow instruction, work independently, and comply with company policies.\nAbility to work independently and provide guidance and leadership to junior team or project members, with strict adherence to QA\/QC.\nCritical thinking and problem-solving skills required to apply technical knowledge to reach conclusions from testing results, data collation, statistical analysis and arriving at the most effective, economical, and logical solution.\nExperience with discipline-specific design software (i.e., AutoCAD)\nProficient with Microsoft Office and general computer usage\nKnowledge of programming language (VB, python, or other) would be an asset\nDemonstrates a 'Safety First\" focus attitude and traits in line with WSP’s core values\nStrong organizational skills\nProven track record of upholding workplace safety and ability to abide by WSP’s health, safety and drug\/alcohol and harassment policies.\nAbility to work schedules conducive to project-specific requirements that may extend beyond the typical workweek.\nAbility to travel and work in other WSP offices as required.\nPreferred Qualifications\nMaster’s Degree in Engineering.\nEssential Professional Licensure\/Certification.\nAbout WSP\nABOUT US\nWSP USA is the U.S. operating company of WSP, one of the world's leading engineering and professional services firms. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the buildings, transportation, energy, water and environment markets. With more than 15,000 employees in over 300 offices across the U.S., we partner with our clients to help communities prosper.\nwww.wsp.com\nWSP provides a flexible and agile workplace model while meeting client needs. Employees are also afforded a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on providing health and financial stability throughout the employee’s career.\nAt WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be essential in meeting client objectives, goals and challenges. Are you ready to get started?\nWSP USA (and all of its U.S. companies) is an Equal Opportunity Employer Race\/Age\/Color\/Religion\/Sex\/Sexual Orientation\/Gender Identity\/National Origin\/Disability or Protected Veteran Status.\nThe selected candidate must be authorized to work in the United States.\nNotice To Third Party Agencies\nWSP does not accept unsolicited resumes from recruiters, employment agencies, or other staffing services. Unsolicited resumes include any resume or hiring document sent to WSP in the absence of a signed Service Agreement where WSP has expressly requested recruitment\/staffing services specific to the position at hand. Any unsolicited resumes, including those submitted to hiring managers or other business leaders, will become the property of WSP and WSP will have the right to hire that candidate without reservation – no fee or other compensation will be owed or paid to the recruiter, employment agency, or other staffing service.\nShow more\nShow less","all_details":"- Supporting senior and intermediate engineering staff in completion of projects in the area of Open Pit and Underground mining rock mechanics and mine closure\n- Performing field work, data collection, field testing, data analysis, excavation stability assessments, and calculations\n- Researching specific rock engineering and mine closure problems\n- Field work will include some aspects of surveying, drilling coordination, geotechnical core logging\/mapping, and construction monitoring\n- Data reduction and analysis of investigation data\n- Preparing and working with 2D and 3D models\n- Assisting with geotechnical characterization and assessments in support of underground, open pit, and mine closure rock mechanics projects\n- Assisting with the preparation of technical reports\n- Role will include a combination of office and field work\n- Work as an individual or as part of a cross-functional team of engineers and scientific professionals to execute project work\n- Conduct geotechnical engineering studies and surveys to gain further information on a particular design, issue, and\/or to plan for future needs.\n- Exercise responsible and ethical decision-making regarding company funds, resources and conduct, and adhere to WSP’s Code of Conduct and related policies and procedures.\n- Perform additional responsibilities as required by business needs.\n- Bachelor’s Degree in Geotechnical Engineering, or closely related discipline.\n- 3 to 5 years of relevant post education experience in engineering and prior geotechnical design experience.\n- Possesses or eligible to receive Engineer in Training Certification.\n- Technical knowledge of geotechnical engineering including: evaluating slope stability, seismic engineering, retaining wall design, earth retention, rock mechanics, ground improvement techniques, support of excavation, dewatering, design\/build, and the application to permitting and project work-related issues.\n- Proficient understanding of the disciplines of rock and soil mechanics to perform mine stability analysis of both surface and underground mining operations.\n- Ability to make technical computations and calculations involving the application of engineering principles, understanding plans and specifications, and making factual comparisons to the appropriate regulations.\n- Project management experience with small to mid-level projects including scoping, and tracking hours and expenses for project work.\n- Capable interpersonal and communication skills when interacting with others, expressing ideas effectively and professionally to an engineering and non-engineering audience.\n- Effective self-leadership with attention to detail, results orientation, and managing multiple priorities in a dynamic work environment.\n- Relevant consulting or operating experience in a mining or consulting setting\n- Ability to learn new techniques, perform multiple tasks simultaneously, follow instruction, work independently, and comply with company policies.\n- Ability to work independently and provide guidance and leadership to junior team or project members, with strict adherence to QA\/QC.\n- Critical thinking and problem-solving skills required to apply technical knowledge to reach conclusions from testing results, data collation, statistical analysis and arriving at the most effective, economical, and logical solution.\n- Experience with discipline-specific design software (i.e., AutoCAD)\n- Proficient with Microsoft Office and general computer usage\n- Knowledge of programming language (VB, python, or other) would be an asset\n- Demonstrates a 'Safety First\" focus attitude and traits in line with WSP’s core values\n- Strong organizational skills\n- Proven track record of upholding workplace safety and ability to abide by WSP’s health, safety and drug\/alcohol and harassment policies.\n- Ability to work schedules conducive to project-specific requirements that may extend beyond the typical workweek.\n- Ability to travel and work in other WSP offices as required.\n- Master’s Degree in Engineering.\n- Essential Professional Licensure\/Certification."}
{"job_id":"4206243949","company":"WSP in the U.S.","title":"Rock Mechanics Engineer","location":"Reno, NV","date_posted":"1 week ago","applicants":"Be among the first 25 applicants","seniority_level":"Entry level","employment_type":"Full-time","job_function":"Management and Manufacturing","industries":"Professional Services","company_website":null,"workplace_type":null,"description":"Job Description\nThis Opportunity\nWSP is currently initiating a search for a Rock Mechanics Engineer for our Reno, NV office. The following locations will also be considered: Tucson, AZ. Be involved in projects with our Mine Engineering & Stability Team and be a part of a growing organization that meets our client’s objectives and solves their challenges.\nYour Impact\nSupporting senior and intermediate engineering staff in completion of projects in the area of Open Pit and Underground mining rock mechanics and mine closure\nPerforming field work, data collection, field testing, data analysis, excavation stability assessments, and calculations\nResearching specific rock engineering and mine closure problems\nField work will include some aspects of surveying, drilling coordination, geotechnical core logging\/mapping, and construction monitoring\nData reduction and analysis of investigation data\nPreparing and working with 2D and 3D models\nAssisting with geotechnical characterization and assessments in support of underground, open pit, and mine closure rock mechanics projects\nAssisting with the preparation of technical reports\nRole will include a combination of office and field work\nWork as an individual or as part of a cross-functional team of engineers and scientific professionals to execute project work\nConduct geotechnical engineering studies and surveys to gain further information on a particular design, issue, and\/or to plan for future needs.\nExercise responsible and ethical decision-making regarding company funds, resources and conduct, and adhere to WSP’s Code of Conduct and related policies and procedures.\nPerform additional responsibilities as required by business needs.\nWho You Are\nRequired Qualifications\nBachelor’s Degree in Geotechnical Engineering, or closely related discipline.\n3 to 5 years of relevant post education experience in engineering and prior geotechnical design experience.\nPossesses or eligible to receive Engineer in Training Certification.\nTechnical knowledge of geotechnical engineering including: evaluating slope stability, seismic engineering, retaining wall design, earth retention, rock mechanics, ground improvement techniques, support of excavation, dewatering, design\/build, and the application to permitting and project work-related issues.\nProficient understanding of the disciplines of rock and soil mechanics to perform mine stability analysis of both surface and underground mining operations.\nAbility to make technical computations and calculations involving the application of engineering principles, understanding plans and specifications, and making factual comparisons to the appropriate regulations.\nProject management experience with small to mid-level projects including scoping, and tracking hours and expenses for project work.\nCapable interpersonal and communication skills when interacting with others, expressing ideas effectively and professionally to an engineering and non-engineering audience.\nEffective self-leadership with attention to detail, results orientation, and managing multiple priorities in a dynamic work environment.\nRelevant consulting or operating experience in a mining or consulting setting\nAbility to learn new techniques, perform multiple tasks simultaneously, follow instruction, work independently, and comply with company policies.\nAbility to work independently and provide guidance and leadership to junior team or project members, with strict adherence to QA\/QC.\nCritical thinking and problem-solving skills required to apply technical knowledge to reach conclusions from testing results, data collation, statistical analysis and arriving at the most effective, economical, and logical solution.\nExperience with discipline-specific design software (i.e., AutoCAD)\nProficient with Microsoft Office and general computer usage\nKnowledge of programming language (VB, python, or other) would be an asset\nDemonstrates a 'Safety First\" focus attitude and traits in line with WSP’s core values\nStrong organizational skills\nProven track record of upholding workplace safety and ability to abide by WSP’s health, safety and drug\/alcohol and harassment policies.\nAbility to work schedules conducive to project-specific requirements that may extend beyond the typical workweek.\nAbility to travel and work in other WSP offices as required.\nPreferred Qualifications:\nMaster’s Degree in Engineering.\nEssential Professional Licensure\/Certification.\nAbout WSP\nABOUT US\nWSP USA is the U.S. operating company of WSP, one of the world's leading engineering and professional services firms. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the buildings, transportation, energy, water and environment markets. With more than 15,000 employees in over 300 offices across the U.S., we partner with our clients to help communities prosper.\nwww.wsp.com\nWSP provides a flexible and agile workplace model while meeting client needs. Employees are also afforded a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on providing health and financial stability throughout the employee’s career.\nAt WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be essential in meeting client objectives, goals and challenges. Are you ready to get started?\nWSP USA (and all of its U.S. companies) is an Equal Opportunity Employer Race\/Age\/Color\/Religion\/Sex\/Sexual Orientation\/Gender Identity\/National Origin\/Disability or Protected Veteran Status.\nThe selected candidate must be authorized to work in the United States.\nNOTICE TO THIRD PARTY AGENCIES:\nWSP does not accept unsolicited resumes from recruiters, employment agencies, or other staffing services. Unsolicited resumes include any resume or hiring document sent to WSP in the absence of a signed Service Agreement where WSP has expressly requested recruitment\/staffing services specific to the position at hand. Any unsolicited resumes, including those submitted to hiring managers or other business leaders, will become the property of WSP and WSP will have the right to hire that candidate without reservation – no fee or other compensation will be owed or paid to the recruiter, employment agency, or other staffing service.\nShow more\nShow less","all_details":"- Supporting senior and intermediate engineering staff in completion of projects in the area of Open Pit and Underground mining rock mechanics and mine closure\n- Performing field work, data collection, field testing, data analysis, excavation stability assessments, and calculations\n- Researching specific rock engineering and mine closure problems\n- Field work will include some aspects of surveying, drilling coordination, geotechnical core logging\/mapping, and construction monitoring\n- Data reduction and analysis of investigation data\n- Preparing and working with 2D and 3D models\n- Assisting with geotechnical characterization and assessments in support of underground, open pit, and mine closure rock mechanics projects\n- Assisting with the preparation of technical reports\n- Role will include a combination of office and field work\n- Work as an individual or as part of a cross-functional team of engineers and scientific professionals to execute project work\n- Conduct geotechnical engineering studies and surveys to gain further information on a particular design, issue, and\/or to plan for future needs.\n- Exercise responsible and ethical decision-making regarding company funds, resources and conduct, and adhere to WSP’s Code of Conduct and related policies and procedures.\n- Perform additional responsibilities as required by business needs.\n- Bachelor’s Degree in Geotechnical Engineering, or closely related discipline.\n- 3 to 5 years of relevant post education experience in engineering and prior geotechnical design experience.\n- Possesses or eligible to receive Engineer in Training Certification.\n- Technical knowledge of geotechnical engineering including: evaluating slope stability, seismic engineering, retaining wall design, earth retention, rock mechanics, ground improvement techniques, support of excavation, dewatering, design\/build, and the application to permitting and project work-related issues.\n- Proficient understanding of the disciplines of rock and soil mechanics to perform mine stability analysis of both surface and underground mining operations.\n- Ability to make technical computations and calculations involving the application of engineering principles, understanding plans and specifications, and making factual comparisons to the appropriate regulations.\n- Project management experience with small to mid-level projects including scoping, and tracking hours and expenses for project work.\n- Capable interpersonal and communication skills when interacting with others, expressing ideas effectively and professionally to an engineering and non-engineering audience.\n- Effective self-leadership with attention to detail, results orientation, and managing multiple priorities in a dynamic work environment.\n- Relevant consulting or operating experience in a mining or consulting setting\n- Ability to learn new techniques, perform multiple tasks simultaneously, follow instruction, work independently, and comply with company policies.\n- Ability to work independently and provide guidance and leadership to junior team or project members, with strict adherence to QA\/QC.\n- Critical thinking and problem-solving skills required to apply technical knowledge to reach conclusions from testing results, data collation, statistical analysis and arriving at the most effective, economical, and logical solution.\n- Experience with discipline-specific design software (i.e., AutoCAD)\n- Proficient with Microsoft Office and general computer usage\n- Knowledge of programming language (VB, python, or other) would be an asset\n- Demonstrates a 'Safety First\" focus attitude and traits in line with WSP’s core values\n- Strong organizational skills\n- Proven track record of upholding workplace safety and ability to abide by WSP’s health, safety and drug\/alcohol and harassment policies.\n- Ability to work schedules conducive to project-specific requirements that may extend beyond the typical workweek.\n- Ability to travel and work in other WSP offices as required.\n- Master’s Degree in Engineering.\n- Essential Professional Licensure\/Certification."}
{"job_id":"4211626900","company":"Generac","title":"Senior Staff Firmware Engineer V","location":"Reno, NV","date_posted":"3 weeks ago","applicants":"Be among the first 25 applicants","seniority_level":"Mid-Senior level","employment_type":"Full-time","job_function":"Engineering and Information Technology","industries":"Electric Power Generation","company_website":null,"workplace_type":null,"description":"We are Generac, a leading energy technology company committed to powering a smarter world.\nOver the 60 plus years of Generac’s history, we’ve been dedicated to energy innovation. From creating the home standby generator market category, to our current evolution into an energy technology solutions company, we continue to push new boundaries.\nGenerac Clean Energy is looking for a motivated Firmware Engineer with curiosity to help create next generation energy storage products. The successful applicant will join a team of highly knowledgeable and collaborative engineers. You will have the opportunity to solve challenging problems that unlock residential PV and energy storage systems at mass scale.\nThe position is available in our Reno, NV OR our North Billerica, MA office.\nEssential Duties & Responsibilities:\nDesign and implement algorithms and state machines to control the operation of an energy-storage system under real-time constraints.\nDevelop, enhance and debug new and existing real-time firmware in C. Deliver high-quality, robust code in a real-time embedded environment.\nDesign safety rated firmware to meet UL1998 or related standards.\nApply industry best practices to deliver simple, high-quality firmware that is well tested, documented and meets requirements.\nWrite automated tests and integrate them into a continuous integration environment.\nPerform hands-on board bring-up, system integration and performance validation work.\nCoach junior engineers and interns, perform code reviews and help improve the development process.\nParticipate in functional safety architecture and processes including FMEA driven development for adherence and validation to meet functional safety standards.\nMinimal Qualifications:\nBS in Electrical Engineering, Computer Science, or related field; MS preferred.\n8+ years of engineering experience with demonstrated expertise in firmware development and device communication. Prior experience in power electronics, or battery product development is a plus.\nKnowledge of C programming language, embedded systems, RTOS and microcontroller HW and protocols (such as SPI communication, DMA). Familiarity with Python, pytest and git is highly desirable.\nExpert level experience electrical test equipment like oscilloscopes, meters, power supplies, grid simulators.\nExperience with CANbus, DBC file management and CANbus tools like cantools, PCAN Explorer, Vector Canalyzer or CANApe is desired.\nExcellent software fundamentals including architectural design, algorithm development, data structures, code modularity, and maintainability.\nPhysical Demands\n: While performing the duties of this job, the employee is regularly required to talk and hear; and use hands to manipulate objects or controls. The employee is regularly required to stand and walk. On occasion the incumbent may be required to stoop, bend or reach above the shoulders. The employee must occasionally lift up to 25 - 50 pounds. Specific conditions of this job are typical of frequent and continuous computer-based work requiring periods of sitting, close vision and ability to adjust focus. Occasional travel.\n“We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability status, protected veteran status, or any other characteristic protected by law.”\nShow more\nShow less","all_details":"- Design and implement algorithms and state machines to control the operation of an energy-storage system under real-time constraints.\n- Develop, enhance and debug new and existing real-time firmware in C. Deliver high-quality, robust code in a real-time embedded environment.\n- Design safety rated firmware to meet UL1998 or related standards.\n- Apply industry best practices to deliver simple, high-quality firmware that is well tested, documented and meets requirements.\n- Write automated tests and integrate them into a continuous integration environment.\n- Perform hands-on board bring-up, system integration and performance validation work.\n- Coach junior engineers and interns, perform code reviews and help improve the development process.\n- Participate in functional safety architecture and processes including FMEA driven development for adherence and validation to meet functional safety standards.\n- BS in Electrical Engineering, Computer Science, or related field; MS preferred.\n- 8+ years of engineering experience with demonstrated expertise in firmware development and device communication. Prior experience in power electronics, or battery product development is a plus.\n- Knowledge of C programming language, embedded systems, RTOS and microcontroller HW and protocols (such as SPI communication, DMA). Familiarity with Python, pytest and git is highly desirable.\n- Expert level experience electrical test equipment like oscilloscopes, meters, power supplies, grid simulators.\n- Experience with CANbus, DBC file management and CANbus tools like cantools, PCAN Explorer, Vector Canalyzer or CANApe is desired.\n- Excellent software fundamentals including architectural design, algorithm development, data structures, code modularity, and maintainability."}
